{"jokes": [{"text": "Economics is the only field in which two people can get a Nobel Prize for saying exactly the opposite thing. \nHumor is evolving, now we have a refinement:\nIt is true, but is not strong enough. Better:\n\"Economics is the only field in which two people can share a Nobel Prize for saying opposing things.\" Specifically, Myrdal and Hayek shared one.\n"}, {"text": "Heard at the Wharton School.\nMan walking along a road in the countryside comes across a shepherd and a huge flock of sheep. Tells the shepherd, \"I will bet you $100 against one of your sheep that I can tell you the exact number in this flock.\" The shepherd thinks it over; it's a big flock so he takes the bet. \"973,\" says the man. The shepherd is astonished, because that is exactly right. Says \"OK, I'm a man of my word, take an animal.\" Man picks one up and begins to walk away.\n\"Wait,\" cries the shepherd, \"Let me have a chance to get even. Double or nothing that I can guess your exact occupation.\" Man says sure. \"You are an economist for a government think tank,\" says the shepherd. \"Amazing!\" responds the man, \"You are exactly right! But tell me, how did you deduce that?\"\n\"Well,\" says the shepherd, \"put down my dog and I will tell you.\"\n"}, {"text": "A mathematician, an accountant and an economist apply for the same job.\nThe interviewer calls in the mathematician and asks \"What do two plus two equal?\" The mathematician replies \"Four.\" The interviewer asks \"Four, exactly?\" The mathematician looks at the interviewer incredulously and says \"Yes, four, exactly.\"\nThen the interviewer calls in the accountant and asks the same question \"What do two plus two equal?\" The accountant says \"On average, four - give or take ten percent, but on average, four.\"\nThen the interviewer calls in the economist and poses the same question \"What do two plus two equal?\" The economist gets up, locks the door, closes the shade, sits down next to the interviewer and says \"What do you want it to equal?\" \n"}, {"text": "TOP 10 REASONS TO STUDY ECONOMICS\n1. Economists are armed and dangerous: \"Watch out for our invisible hands.\"\n2. Economists can supply it on demand.\n3. You can talk about money without every having to make any.\n4. You get to say \"trickle down\" with a straight face.\n5. Mick Jagger and Arnold Schwarzenegger both studied economics and look how they turned out.\n6. When you are in the unemployment line, at least you will know why you are there.\n7. If you rearrange the letters in \"ECONOMICS\", you get \"COMIC NOSE\".\n8. Although ethics teaches that virtue is its own reward, in economics we get taught that reward is its own virtue.\n9. When you get drunk, you can tell everyone that you are just researching the law of diminishing marginal utility.\n10. When you call 1-900-LUV-ECON and get Kandi Keynes, you will have something to talk about.\n"}, {"text": "ECONOMISTS do it at bliss point\nECONOMISTS do it cyclically\nECONOMISTS do it in an Edgeworth Box\nECONOMISTS do it on demand\nECONOMISTS do it risk-free (in reference to the risk-free interest rate)\nECONOMISTS do it with a dual\nECONOMISTS do it with an atomistic competitor\nECONOMISTS do it with crystal balls\nECONOMISTS do it with interest\nEconomists do it with models\nEconometricians do it if they can identify it.\nApplied econometricians do it even if they can't. \nEconomists do it with Slutsky matrices. \nEconomists do it discretely AND continuously. \nEconomists do it on Leontief's table.\nEconometricians do it with dummies? \n"}, {"text": "Morry Adelman at MIT claims that he heard this at Shell long ago:\n\"A planner is a gentle man,\nwith neither sword nor pistol.\nHe walks along most daintily,\nbecause his balls are crystal.\"\n"}, {"text": "An economist is a trained professional paid to guess wrong about the economy. An econometrician is a trained professional paid to use computers to guess wrong about the economy.\n"}, {"text": "Talk is cheap. Supply exceeds Demand. \n"}, {"text": "Bentley's second Law of Economics: The only thing more dangerous than an economist is an amateur economist!\nBerta's Fundamental Law of Economic Rents.. \"The only thing more dangerous than an amateur economist is a professional economist.\"\n"}, {"text": "A true story:\n\"I heard this from one of my professors. To protect him, no names will be revealed. This professor was about to get married. He went to the jewelers to get a wedding ring for his fiancee. The jeweler told him that he can have the inside of the ring engraved with the name of his fiancee for an additional $20 (remember, this was a LONG time ago). He said, \"But that will reduce the resale value!\" The jeweler was aghast. He said, \"How can you say such a thing. You are a butcher!\" \"No,\" replied the professor, \"I am an economist\".\"\ntold by Tapen Sinha, PhD\n"}, {"text": "An economic forecaster was known to have an horseshoe prominently displayed above the door frame of his office. Asked what it was for, he replied that it was a good luck charm that helped his forecasts. But do you believe in that superstition? he was asked, and he said, \"Of course not!\" But then why do you keep it? \"Well,\" he said, \"it works whether you believe in it or not.\"\n The story is actually told about a non-economist, Danish Nobel prize winner Niels Bohr.\nSince the publication of the joke I've been told that Bohr actually said that *he had been told* that it works whether... \n"}, {"text": "Economics has gotten so rigorous we've all got rigor mortis.\nPresumably said by Kenneth Boulding\n A possible correction by Mike: Kenneth Boulding said, \"Mathematics brought rigor to Economics. Unfortunately, it also brought mortis.\" \n"}, {"text": "Economist related joke: Definition: Policy Analyst is someone unethical enough to be a lawyer, impractical enough to be a theologian, and pedantic enough to be an economist. \n"}, {"text": "There is one joke opportunity in Robert Kuttner, The Poverty of Economics, The Atlantic Monthly, Feb 1985, p. 79, which says: \"George Stigler Nobel laureate and a leader of Chicago School was asked why there were no Nobel Prizes awarded in the other social sciences, sociology, psychology, history, etc. \"Don't worry\", Stigler said, \"they have already have a Nobel Prize in ...Literature\" \n"}, {"text": "An economist was standing at the shore of a large lake, surf-casting. It was the middle of winter, and the lake was completely frozen over, but this didn't seem to bother the economist, who stood there patiently casting his lure out across the ice, slowly reeling it in again, then repeating the process.\nA mathematical economist came sailing by on an ice boat, and pulled to the shore beside the surf-fishing economist to scoff. \"You'll never catch any fish that way,\" said the mathematical economist. \"Jump on my ice-boat and we'll go trawling.\" \n"}, {"text": "Three econometricians went out hunting, and came across a large deer. The first econometrician fired, but missed, by a meter to the left. The second econometrician fired, but also missed, by a meter to the right. The third econometrician didn't fire, but shouted in triumph, \"We got it! We got it!\" \n"}, {"text": "A mathematician, a theoretical economist and an econometrician are asked to find a black cat (who doesn't really exist) in a closed room with the lights off:\n- The mathematician gets crazy trying to find a black cat that doesn't exist inside the darkened room and ends up in a psychiatric hospital.\n- The theoretical economist is unable to catch the black cat that doesn't exist inside the darkened room, but exits the room proudly proclaiming that he can construct a model to describe all his movements with extreme accuracy.\n- The econometrician walks securely into the darkened room, spend one hour looking for the black cat that doesn't exits and shouts from inside the room that he has it catched by the neck.\" \n"}, {"text": "True story. I'm riding up the elevator at the Boston ASSA meetings a few years back. In the car with me is a woman who works in the hotel. I ask her if economists are really as dull a bunch as they're made out to be. She responds that she used to be stationed at the NYC branch of the chain when the meetings were held there and that even the hookers had taken the week off.\nCarlos Bonilla \n"}, {"text": "Practice economy at any cost. \n"}, {"text": "from \"The Hitchhiker's Guide to the Galaxy\" by Douglas Adams, Chapter 16.\nArthur awoke to the sound of argument and went to the bridge. Ford was waving his arms about. \"You're crazy Zaphod,\" he was saying, \"Magrathea is a myth a fairy story, it's what parents tell their kids about at night if they want them to grow up to be economists, it's...\" \n"}, {"text": "from the preface to Paul Krugman's book, \"Peddling Prosperity: Economic Sense and Nonsense in the Age of Diminished Expectations\" (1994, page xi): An Indian-born economist once explained his personal theory of reincarnation to his graduate economics class. \"If you are a good economist, a virtuous economist,\" he said, \"you are reborn as a physicist. But if you are an evil, wicked economist, you are reborn as a sociologist.\" \n"}, {"text": "When two economists are out for a stroll together, how do you identify the UofC economist? He's the one walking randomly. \n"}, {"text": "Heard at the workshop of evolutionary economists at IIASA:\n Q: How has French revolution affected world economic growth?\nA: Too early to say. \n"}, {"text": "True story: I was standing with Ken Arrow by a bank of elevators on the ground floor of William James Hall at Harvard. Three elevators passed us on our way to the basement. I foolishly said \"I wonder why everybody in the basement wants to go upstairs.\" He responded, almost instantly: \"You're confusing supply with demand.\"\nCurt Monash \n"}, {"text": "Economist poem\nIf you do some acrobatics\nwith a little mathematics\nit will take you far along.\nIf your idea's not defensible\ndon't make it comprehensible\nor folks will find you out,\nand your work will draw attention\nif you only fail to mention\nwhat the whole thing is about.\nYour must talk of GNP\nand of elasticity\nof rates of substitution\nand undeterminate solution\nand oligonopopsony.\n Kenneth E. BOULDING \n"}, {"text": "Q. What do economists and computers have in common ??\nA. You need to punch information into both of them.\n"}, {"text": "Why does Treasury only have 10 minutes for morning tea ??\nA. If they had any longer, they would need to re-train all the economists. \n"}, {"text": "Two economists were walking down the street when they noticed two women yelling across the street at each other from their apartment windows.\nOf course they will never come to agreement, stated the first economist.\nAnd why is that, inquired his companion,\nWhy, of course, because they are arguing from different premises. \n"}, {"text": "A civil engineer, a chemist and an economist are traveling in the countryside. Weary, they stop at a small country inn. \"I only have two rooms, so one of you will have to sleep in the barn,\" the innkeeper says. The civil engineer volunteers to sleep in the barn, goes outside, and the others go to bed. In a short time they're awakened by a knock. It's the engineer, who says, \"There's a cow in that barn. I'm a Hindu, and it would offend my beliefs to sleep next to a sacred animal.\" The chemist says that, OK, he'll sleep in the barn. The others go back to bed, but soon are awakened by another knock. It's the chemist who says, \"There's a pig in that barn. I'm Jewish, and cannot sleep next to an unclean animal.\" So the economist is sent to the barn. It's getting late, the others are very tired and soon fall asleep. But they're awakened by an even louder knocking. They open the door and are surprised by what they see: It's the cow and the pig!\n"}, {"text": "Three economists and three mathematicians were going for a trip by train. Before the journey, the mathematicians bought 3 tickets but economists only bought one. The mathematicians were glad their stupid colleagues were going to pay a fine. However, when the conductor was approaching their compartment, all three economists went to the nearest toilet. The conductor, noticing that somebody was in the toilet, knocked on the door. In reply he saw a hand with one ticket. He checked it and the economists saved 2/3 of the ticket price.\nThe next day, the mathematicians decided to use the same strategy- they bought only one ticket, but economists did not buy tickets at all! When the mathematicians saw the conductor, they hid in the toilet, and when they heard knocking they handed in the ticket. They did not get it back.\nWhy? The economists took it and went to the other toilet.\n"}, {"text": "A party of economists was climbing in the Alps . After several hours they became hopelessly lost. One of them studied the map for some time, turning it up and down, sighting on distant landmarks, consulting his compass, and finally the sun.\nFinally he said, ' OK see that big mountain over there?'\n'Yes', answered the others eagerly.\n'Well, according to the map, we're standing on top of it.' \n"}, {"text": "Did you hear of the economist who dove into his swimming pool and broke his neck?\nHe forgot to seasonally adjust his pool. \n"}, {"text": "If all the economists were laid end to end they would be an orgy, of mathematics. \n"}, {"text": "A wealthy labor economist had an urge to have grandchildren. He had two daughters and two sons and none of them had gratified his desire for a grandchild. At the annual family gathering on Thanksgiving Day, he chided them gently to bless his old age with their progeny. \"But I haven't given up hope,\" he said, \"Yesterday I went to the bank and set up a one hundred thousand dollar trust fund to be given to the first grandchild that I have. Now we will all bow our heads while I say a prayer of thanks.\" When he looked up, he and his wife were the only ones at the table. \n"}, {"text": "NATURAL RATE OF UNEMPLOYMENT\nNewlan's Truism: An \"acceptable\" level of unemployment means that the government economist to whom it is acceptable still has a job. \n"}, {"text": "Q Why did the market economist cross the road?\nA To reach the consensus forecast.\n"}, {"text": "Q: What does an economist use when calculating constant-dollar estimates?\nA: Deflator mouse \n"}, {"text": "created by Pat Marren \nSubject: TOP TEN ECONOMIST VALENTINES\n10. YOU RAISE MY INTEREST RATE THIRTY BASIS POINTS WITHOUT A CORRESPONDING DROPOFF IN CONSUMER ENTHUSIASM\n9. DESPITE A DECADE OF INFLATION, I STILL DIG YOUR SUPPLY CURVE\n8. WHAT DO YOU SAY WE REMEASURE OUR CROSS-ELASTICITY\n7. YOU BRING THE BUTTER, I'LL BRING THE GUN\n6. LET'S RAISE HOUSING STARTS TOGETHER\n5. FURTHER STIMULUS COULD RESULT IN UNCONTROLLED EXPANSION\n4. TELL ME WHETHER MY EXPECTATIONS ARE RATIONAL\n3. LET'S ASSUME A RITZY HOTEL ROOM AND A BOTTLE OF DOM\n2. YOU STOKE THE ANIMAL SPIRITS OF MY MARKET\n1. A LOAF OF BREAD, A JUG OF WINE, AND THOU BESIDE ME WATCHING RUKEYSER \n"}, {"text": "When Albert Einstein died, he met three New Zealanders in the queue outside the Pearly Gates. To pass the time, he asked what were their IQs. The first replied 190. \"Wonderful,\" exclaimed Einstein. \"We can discuss the contribution made by Ernest Rutherford to atomic physics and my theory of general relativity\". The second answered 150. \"Good,\" said Einstein. \"I look forward to discussing the role of New Zealand's nuclear-free legislation in the quest for world peace\". The third New Zealander mumbled 50. Einstein paused, and then asked, \"So what is your forecast for the budget deficit next year?\" (Adapted from Economist, 1992). \n"}, {"text": "Two men are flying in a captive balloon. The wind is ugly and they come away from their course and they have no idea where they are. So they go down to 20 m above ground and ask a passing wanderer. \"Could you tell us where we are?\"\n\"You are in a balloon.\"\nSo the one pilot to the other:\n\"The answer is perfectly right and absolutely useless. The man must be an economist\"\n\"Then you must be businessmen\", answers the man.\n\"That's right! How did you know?\"\n\"You have such a good view from where you are and yet you don't know where you are!\"\nLight bulb jokes are always in...\n"}, {"text": "Q: How many Chicago School economists does it take to change a light bulb?\nA: None. If the light bulb needed changing the market would have already done it.\n"}, {"text": "Q: How many mainstream economists does it take to change a light bulb?\nA1: Two. One to assume the existence of ladder and one to change the bulb.\nA2: Two. One to assume the existence of latter and one to change the bulb. \n"}, {"text": "Q: How many neo-classical economists does it take to change a light bulb?\nA: It depends on the wage rate. \n"}, {"text": "Q: How many conservative economists does it take to change a light bulb?\nA1: None. The darkness will cause the light bulb to change by itself.\nA2: None. If it really needed changing, market forces would have caused it to happen.\nA3: None. If the government would just leave it alone, it would screw itself in.\nA4. None. \"There is no need to change the light bulb. All the conditions for illumination are in place.\nA5. None, because, look! It's getting brighter! It's definitely getting brighter !!!\nA5. None; they're all waiting for the unseen hand of the market to correct the lighting disequilibrium.\n"}, {"text": "Q: How many Wharton MBAs does it take to change a light bulb?\nA: Only one, if you hire me. I can actually change the light bulb by myself. As you can see from my resume, I've had extensive experience changing light bulbs in my previous positions. I've also been named to the Wharton Light Bulb list, and am presently a teaching assistant for Light Bulb Management 666. My only weakness is that I'm compulsive about changing light bulbs in my spare time.\n"}, {"text": "Q: How many B-school doctoral students does it take to change a light bulb?\nA: I'm writing my dissertation on that topic; I should have an answer for you in about 5 years.\n"}, {"text": "Q: How many investors does it take to change a light bulb?\nA: None - the market has already discounted the change.\n"}, {"text": "Q: How many Keynesian economists does it takes to change a light bulb?\nA: All. Because then you will generate employment, more consumption, dislocating the AD (agg. demand) to the right,... \n"}, {"text": "Q: How many Trotskyists does it take to change a lightbulb?\nA: None. Smash it! \n"}, {"text": "Q; How many central bank economists does it take to screw in a lightbulb?\nA: Just one -- he holds the lightbulb and the whole earth revolves around him. \n"}, {"text": "Q: How many marxists does it take to screw in a lightbulb?\nA: None - the bulb contains within it the seeds of its own revolution. \n"}, {"text": "How many environmental economists does it take to change a lightbulb? Eight - one to turn the lightbulb and seven to do the environmental impact study.\n"}, {"text": "It's not easy being an economist. How would you like to go through life pretending you knew what M1 was all about? \n"}, {"text": "An elderly economics professor is standing at the shallow end of the campus pool. A Coed is standing at the deep end taking pictures. She suddenly drops the camera into the pool. Then she motions for the professor to come to her. He goes and she asks him to retrieve the camera. He agrees and dives in and retrieve its.\nUpon returning he says to her, \"Why did you ask me to retrieve the camera when there were many younger and more athletic males closer to her?\" She replied, \"Professor you seem to forget that I'm in your Econ I class, and I don't know anyone who can go down deeper, stay down longer and come up drier than you.\"\n"}, {"text": "When drawing up the guest list for a dinner party, inviting more than 25% economists ruins the conversation. \n"}, {"text": "Economics is the painful elaboration of the obvious. \n"}, {"text": "Q: How many economists does it take to change a light bulb?\nA: Seven, plus/minus ten. \n"}, {"text": "Q:How many economists does it take to change a light bulb?\nA: Irrelevant - the light bulb's preferences are to be taken as given. \n"}, {"text": "True story: The scene is a conference of professors of marketing. The keynote speaker is an eminent economist. The chairman, who sees himself as a bit of a wag, says,\n\"I would like to introduce my eminent colleague and friend. He's an economist, one of those people who turn random numbers into mathematical laws.\"\nThe economist, not to be outdone, replies,\n\"My friend, here, is a marketer. They reverse the process.\"\n"}, {"text": "A Swedish contribution:\n\"Economics is like red whine - you shouldn't smell it but drink it, but if you drink too much on one occasion, there is a risk for dizziness\"\n"}, {"text": "One day a man walked into the main library of a major research university. He stopped at the reference desk and asked the librarian if she had any current books about economics and the economy.\nShe answered that she did, and led the man to the reference shelves where the economics and economy books were.\nTo the surprise of both the librarian and the man all of the books were off the shelf being used.\n\"That's OK,'' the man said. \"I'll just go to another library. You see, I'm a very busy man, and I set this weekend aside for studying economics and the economy.''\nThe librarian said she understood and gave the man directions to the nearest research library. But her interest piqued, she asked: \"Why are you so urgent to study economics and the economy?''\nThe man replied: \"I'm an economist. I've been teaching at this university for the past ten years. I'm attending a business meeting on Monday, and I figure the economy has changed in the past ten years.\" \n"}, {"text": "Economists do it with cross partials... \n"}, {"text": "Q. What's the difference between an economist and a befuddled old man with Alzheimer's?\nA. The economist is the one with the calculator. \n"}, {"text": "One day a woman went for a walk in her neighborhood and came across a boy with some puppies. \"Would you like a puppy? They aren't ready for new homes quite yet, but they will be in a few weeks!\"\n\"Oh, they're adorable,\" the lady said. \"What kind of dogs are they?\"\n\"These are economists.\"\n\"OK. I'll tell my husband.\"\nSo she went home and told her husband. He was very interested to see the puppies. About a week later he came across the lad; the puppies were very active.\n\"Hey, Mister. Want a puppy?\"\n\"I think my wife spoke with you last week. What kind of dogs are these?\"\n\"Oh. These are decision analysts.\"\n\"I thought you said last week that they were economists.\"\n\"Yeah, but they've opened their eyes since then.\" \n"}, {"text": "An economist is someone who doesn't know what he's talking about - and make you feel it's your fault. \n"}, {"text": "The definition of \"waste\": a busload of economists plunging over a precipice with three of the seats unoccupied. \n"}, {"text": "I was riding my bike down a hill in my city one night and two policemen stopped me at their speed trap. They asked me how fast I was going - 63 km - and congratulated me on the accuracy of my speedo. They then asked me why I was not driving a car and as I was a woman, wasn't it dangerous to be be out at night on a bike. I said I did not drive a car. They then asked me my occupation - I said \"an economist\". One of the policemen said \"That's why she's riding a bike - she's economising\"\nI know that economics is ruling my life when\n- I tried to calculate my 3 year old son's discount rate by seeing how many sweets he would require to be promised to him after dinner to be equivalent to one sweet before dinner\n- I spent one hour in a toy shop making up over 20 bundles of toys that could be purchased for $25 and then asked my son to select one of these bundles\nBrita P \n"}, {"text": "Bill and Boris are taking a break from a long summit, Boris says to Bill, -Bill, you know, I have a big problem I don't know what to do about. I have a hundred bodyguards and one of them is a traitor. I don't know which one. -Not a big deal Boris, I'm stuck with a hundred economists I have to listen to all the time before any policy decision, and only one tells the truth but it's never the same one.\n"}, {"text": "Two government economists were returning home from a field meeting. As with all government travelers, they were assigned the cheapest seats on the plane so they each were occupying the center seat on opposite sides of the aisle. They continued their discussion of the knotty problem that had been the subject of their meeting through takeoff and meal service until finally one of the passengers in an aisle seat offered to trade places so they could talk and he could sleep. After switching seats, one economist remarked to the other that it was the first time an economic discussion ever kept anyone awake. \n"}, {"text": "Robert J. BARRO in his 1989 paper in the Journal of Economic Perspectives:\n\"A colleague of mine argues that a 'normative' model should be defined as a model that fits the data badly.\"\n Found in a paper of Anatol RAPOPORT (Scientific American, July 1967) who tells the following joke which he found in 'The Complete Strategist' by J. D. Williams:\n\"Two policemen are considering the problem of catching the bandit. One of them starts to calculate the optimal mixed strategy for the chase. The other policeman protests.\n'While we're doodling,' he points out, 'he is making his getaway.'\n'Relax,' says the game-theorist policeman. 'He's got to figure it out too, don't he?'\" \n"}, {"text": "During the waning days of communism in the Soviet Union, an inspector was encharged with visiting local poultry farmers and inquiring about the amount of feed they were giving their chickens. Central planning was still in effect and each farmer was allocated 15 Roubles to spend on chicken feed.\nOne farmer very honestly answered that he spent five of the allocated 15 Roubles on chicken feed. The inspector took this to mean that the thieving farmer pocketed the other ten and promptly had him imprisoned.\nHearing of this through the rumour mill, the next farmer down the road insisted that he spent all 15 Roubles on food for the chickens. The inspector saw this as a case of budget-padding and the farmer as a wasteful opportunist. He too was imprisoned.\nThe third farmer heard of both episodes and was more prepared for the inspector's arrival.\n\"How many of the 15 Roubles do you actually spend on chicken feed,\" asked the inspector.\nLike a true nascent capitalist, the farmer threw his hands in the air and answered, \"hey! I give 15 Roubles to the chickens. They can eat whatever they want!\"\n"}, {"text": "Experienced economist and not so experienced economist are walking down the road. They get across shit lying on the asphalt.\nExperienced economist: \"If you eat it I'll give you $20,000!\"\nNot so experienced economist runs his optimization problem and figures out he's better off eating it so he does and collects money.\nContinuing along the same road they almost step into yet another shit.\nNot so experienced economist: \"Now, if YOU eat this shit I'll give YOU $20,000.\"\nAfter evaluating the proposal experienced economist eats shit getting the money.\nThey go on. Not so experienced economist starts thinking: \"Listen, we both have the same amount of money we had before, but we both ate shit. I don't see us being better off.\"\nExperienced economist: \"Well, that's true, but you overlooked the fact that we've been just involved in $40,000 of trade.\"\n"}, {"text": "What's the difference between economists and businessmen: the first don't keep their feet on the ground; the latest use to keep their four feet in the ground \n"}, {"text": "An economist is someone who knows the price of everything and the value of nothing. \n"}, {"text": "Following story is to demonstrate some possible implications of the above statement. Two stangers, a man and a woman, meet in a cafe, the man asks.\n\"My Dear, would you go to bed with me for a million dollars?\"\n\"Well, yes, I guess I would.\"\n\"How about $100?\"\n\"What kind of person do you think I am?\"\n\"My Dear, we have already established that. We are merely haggling over the price!\" \nAccording to Ross Emmet, the story was told by George Bernard Shaw. The man and woman are Winston Churchill and Lady Astor and the incident allegedly did occur.\n"}, {"text": "Economists are people who are too smart for their own good and not smart enough for anyone else's.\n"}, {"text": "From Ambrose Bierce, The Devil's Dictionary:\nTariff -- A scale of taxes on imports, designed to protect the domestic producer against the greed of his consumer.\nEconomy -- Purchasing the barrel of whiskey that you do not need for the price of the cow that you cannot afford. \n"}, {"text": "A woman hears from her doctor that she has only half a year to live. The doctor advises her to marry an economist and to live in South Dakota. The woman asks: will this cure my illness? Answer of the doctor: No, but the half year will seem pretty long. \n"}, {"text": "A boy was crossing a road one day when a frog called out to him and said, \"If you kiss me, I'll turn into a beautiful princess.\" He bent over, picked up the frog and put it in his pocket. The frog spoke up again and said, \"If you kiss me and turn me back into a beautiful princess, I will stay with you for one week.\" The boy took the frog out of his pocket, smiled at it, and returned it to his pocket. The frog then cried out, \"If you kiss me and turn me back into a princess, I'll stay with you and do ANYTHING you want.\" Again the boy took the frog out, smiled at it and put it back into his pocket. Finally, the frog asked, \"What is the matter? I've told you I'm a beautiful princess, that I'll stay with you for a week and do anything you want. Why won't you kiss me?\" The boy said, \"Look, I'm an economist. I don't have time for a girlfriend, but a talking frog is cool.\" \n"}, {"text": "Q:Why did God create economists ?\nA:In order to make weather forecasters look good.\n"}, {"text": "Q: Why did the economist cross the road?\nA: It was the chicken's day off. \n"}, {"text": "Q. What does an economist do?\nA. A lot in the short run, which amounts to nothing in the long run. \n"}, {"text": "Two economists meet on the street. One inquires, \"How's your wife?\" The other responds, \"Relative to what?\" \n"}, {"text": "To an economist, real life is a special case. \n"}, {"text": "I asked an economist for her phone number....and she gave me an estimate. \n"}, {"text": "Q: How many economists does it take to change a lightbulb?\nA: Eight. One to screw it in and seven to hold everything else constant. \n"}, {"text": "Conversation between two Dinosaurs:\nDinosaur #1: \"How many economists does it take to screw in a light bulb?\"\nDinosaur #2: \"What is an economist?\"\nDinosaur #1: \"A flunkie mathematician who tries to predict the population of kangaroos in Australia. But that's not important and don't ask what a Kangaroo is.\"\nDinosaur #2: \"I don't know, how many?\"\nDinosaur #1: \"10 economists and one grad student. One economist to make a model, one to run the regression, one to test the hypothesis, one to interpret the results, one to conclude how to screw it on, one grad student to screw it on, and five economists trying to fight off the dinosaurs trying to eat them. \n"}, {"text": "Economists have forecasted 9 out of the last 5 recessions. \n"}, {"text": "An econometrician and an astrologer are arguing about their subjects. The astrologer says, \"Astrology is more scientific. My predictions come out right half the time. Yours can't even reach that proportion\". The econometrician replies, \"That's because of external shocks. Stars don't have those\". \n"}, {"text": "SOCIALISM: You have two cows. State takes one and give it to someone else.\nCOMMUNISM: You have two cows. State takes both of them and gives you milk.\nFASCISM: You have two cows. State takes both of them and sell you milk.\nNAZISM: You have two cows. State takes both of them and shoot you.\nBUREAUCRACY: You have two cows. State takes both of them, kill one and spill the milk in system of sewage.\nCAPITALISM: You have two cows. You sell one and buy a bull.\n"}, {"text": "FEUDALISM: You have two cows. Your lord takes some of the milk.\nPURE SOCIALISM: You have two cows. The government takes them and puts them in a barn with everyone else's cows. You have to take care of all the cows. The government gives you as much milk as you need.\nBUREAUCRATIC SOCIALISM: You have two cows. The government takes them and puts them in a barn with everyone else's cows. They are cared for by ex-chicken farmers. You have to take care of the chickens the government took from the chicken farmers. The government gives you as much milk and as many eggs as the regulations say you should need.\nFASCISM: You have two cows. The government takes both, hires you to take care of them, and sells you the milk.\nPURE COMMUNISM: You have two cows. Your neighbors help you take care of them, and you all share the milk.\nRUSSIAN COMMUNISM: You have two cows. You have to take care of them, but the government takes all the milk.\nDICTATORSHIP: You have two cows. The government takes both and shoots you.\nSINGAPORE DEMOCRACY: You have two cows. The government fines you for keeping two unlicensed animals in an apartment.\nMILITARIANISM: You have two cows. The government takes both and drafts you.\nPURE DEMOCRACY: You have two cows. Your neighbors decide who gets the milk.\nREPRESENTATIVE DEMOCRACY: You have two cows. Your neighbors pick someone to tell you who gets the milk.\nAMERICAN DEMOCRACY: The government promises to give you two cows if you vote for it. After the election, the president is impeached for speculating in cow futures. The press dubs the affair \"Cowgate\".\nBRITISH DEMOCRACY: You have two cows. You feed them sheep's brains and they go mad. The government doesn't do anything.\nBUREAUCRACY: You have two cows. At first the government regulates what you can feed them and when you can milk them. Then it pays you not to milk them. After that it takes both, shoots one, milks the other and pours the milk down the drain. Then it requires you to fill out forms accounting for the missing cows.\nANARCHY: You have two cows. Either you sell the milk at a fair price or your neighbors kill you and take the cows.\nCAPITALISM: You have two cows. You sell one and buy a bull.\nHONG KONG CAPITALISM: You have two cows. You sell three of them to your publicly listed company, using letters of credit opened by your brother-in-law at the bank, then execute a debt/equity swap with associated general offer so that you get all four cows back, with a tax deduction for keeping five cows. The milk rights of six cows are transferred via a Panamanian intermediary to a Cayman Islands company secretly owned by the majority shareholder, who sells the rights to all seven cows' milk back to the listed company. The annual report says that the company owns eight cows, with an option on one more. Meanwhile, you kill the two cows because the Feng Shui is bad.\nENVIRONMENTALISM: You have two cows. The government bans you from milking or killing them.\nFEMINISM: You have two cows. They get married and adopt a veal calf.\nTOTALITARIANISM: You have two cows. The government takes them and denies they ever existed. Milk is banned.\nPOLITICAL CORRECTNESS: You are associated with (the concept of \"ownership\"is a symbol of the phallo-centric, war-mongering, intolerant past) two differently-aged (but no less valuable to society) bovines of non-specified gender.\nCOUNTER CULTURE: Wow, dude, there's like... these two cows, man. You got to have some of this milk. Far out! Awesome!\nSURREALISM: You have two giraffes. The government requires you to take harmonica lessons.\nJAPANESE DEMOCRACY: You have two cows. You give the milk to gangsters so they don't ask any awkward questions about who you're giving the milk to.\nEUROPEAN FEDERALISM: You have two cows which cost too much money to care for because everybody is buying milk imported from some cheap east-European country and would never pay the fortune you'd have to ask for your cows' milk. So you apply for financial aid from the European Union to subsidise your cows and are granted enough subsidies. You then sell your milk at the former elevated price to some government-owned distributor which then dumps your milk onto the market at east-European prices to make Europe competitive. You spend the money you got as a subsidy on two new cows and then go on a demonstration to Brussels complaining that the European farm-policy is going drive you out of your job.\nEASTERN EUROPEAN DEMOCRACY: You have two cows. You sell the milk (diluted with some water) at a high price to the neighbors or to anyone at the open-air market. If somebody asks for receipt, you charge for a two times higher price, so nobody will request an invoice. For concerned families with small babies you claim that the milk is \"bio\", though you collect the grass for feeding at the side of the highway and you keep the milk in plastic barrels used previously as containers of dangerous chemicals. Later, your neighbor or anybody from town will steal the cows and will buy their meat for a high price, and if you ask for a receipt, you will be charged for a two times higher price.\nFINNISH SOCIALISM: You have two cows. Soon you have to kill one of them because in the Netherlands there is an overproduction of milk and the European Union rules say so. When you do so, you realize that it was not necessary, only the system was too slow in getting you the up-to-date news. From the stress, you get an ulcer in your stomach so you go to a doctor. The doctor realizes that this ulcer is a serious one, so you need an urgent treatment. Therefore, you soon get a call to the local hospital. The call's date is for 3 months later, because there is a queue with more urgent cases. Then your ulcer becomes even more serious because you remember that 40 percent of your income is taken for social tax. \n"}, {"text": "Q: What do you call a little girl in a brown dress who is running across a playground?\nA: A brownian motion.\n"}, {"text": "David Gunn (Scotland): \"Eighty percent of rules of thumb only apply 20 percent of the time\" \n"}, {"text": "This one I attribute to Richard Thaler, now at the Univ of Chicago.\nWhen an economist says the evidence is \"mixed,\" he or she means that theory says one thing and data says the opposite. \n"}, {"text": "From Peter Kennedy's \"A Guide to Econometrics\" (MIT Press, 1992):\n(P. 7) [Econometrics is...] the art of drawing a crooked line from an unproved assumption to a foregone conclusion.\" \n"}, {"text": "True story: One day in microeconomics, the professor was writing up the typical \"underlying assumptions\" in preparation to explain a new model. I turned to my friend and asked, \"What would Economics be without assumptions?\" He thought for a moment, then replied, \"Accounting.\" \n"}, {"text": "Q: Why has astrology been invented? A: So that economy could be an accurate science. \n"}, {"text": "This is a true story:\nBack in the mid-1970s, I attended an ASSA/AEA convention in Dallas. During the third day of the convention, one of the bellhops at the convention hotel asked me who the people attending the convention were and what we did for a living.\n\"We're economists,\" I replied. \"Why do you ask?\"\n\"I don't know..... no women, no drugs, just booze, booze, booze.\"\nJohn Palmer \n"}, {"text": "An old joke applied to economists.\nOne night a policeman saw a macroeconomist looking for something buy a lightpole.  He asked him is had had lost something there.  The economist said, \"I lost my keyes over in the alley.\"  The policeman asked him why he was looking by the lightpole.  The economist responded, \"it's a lot easier to look over here.\"\n"}, {"text": "This tale is said to be told by John Kenneth Galbraith on himself. As a boy he lived on a farm in Canada. On the adjoining farm, lived a girl he was fond of.  One day as they sat together on the top rail of the cattle pen they watced a bull servicing a cow. Galbraith turned to the girl, with what he hoped was a suggestive look, saying,  \"That looks like it would be fun.\"  She replied, \"Well....she's your cow.\"\n"}, {"text": "An economist is someone who gets rich explaining others why they are poor.\n"}, {"text": "Not a joke as such, but (a true story, apparently, as told by a Finance lecturer at LSE):\nAn economist was about to give a presentation in Washington, DC on the problems with Black-Scholes model of option pricing and was expecting no more than a dozen of government officials attending (who would bother?). To his amazement, when he arrived, the room was packed with edgy, tough-looking guys in shades. Still, after five or so minutes into the presentation all of them stood up and left without a word. The economist found out only later\nthat his secretary ran the presentation through a spell-checker and what was \"The Problem with Black-Scholes\" became  \"The Problem with Black Schools\", a rather more fascinating subject.\n"}, {"text": "The last severe depression and banking crisis could not have been achieved by normal civil servants and politicians, it required economists involvement.\n"}, {"text": "\"I'd rather be vaguely right than precisely wrong.\"\n- J.M.Keynes; Found in Forbes magazine 01/25/1999 issue.  In the Numbers Game column by Bernard Cohen \n"}, {"text": "A joke from the October 1992 Reader's Digest, the Best Medicine section:\n\"I'm thinking of leaving my husband,\" complained the economist's wife.\n\"All he ever does is stand at the end of the bed and tell me how good things are going to be.\" \n"}, {"text": "Q: Why do social workers refuse to sleep with economists?\nA: They have learned its a sunk cost. \n"}, {"text": "Q: Why do Economists provide estimates of inflation to the nearest tenth of a percent?\nA: To prove they have a sense of humour. \n"}, {"text": "\"Economic statistics are like a bikini, what they reveal is important, what they conceal is vital\"\n- Attributed to Professor Sir Frank Holmes, Victoria University, Wellington, New Zealand, 1967. \n"}, {"text": "\"An economist is a person who confronted with a eight foot high wall, immediately assumes he is ten feet tall.\"\n- Attributed to John Zanetti, Senior Lecturer, Victoria University, Wellington, New Zealand 1971. \n"}, {"text": "Contagion: A strory demostrating the possible outcomes from interlinkages in the financial markets.\nBack during the Solidarity days, I heard that the following joke was being told in Poland:\nA man goes into the Bank of Gdansk to make a deposit. Since he has never kept money in a bank before, he is a little nervous.\n\"What happens if the Bank of Gdansk should fail?\" he asks.\n\"Well, in that case your money would be insured by the Bank of Warsaw.\"\n\"But, what if the Bank of Warsaw fails?\"\n\"Well, there'd be no problem, because the Bank of Warsaw is insured by the National Bank of Poland.\"\n\"And if the National Bank of Poland fails?\"\n\"Then your money would be insured by the Bank of Moscow.\"\n\"And what if the Bank of Moscow fails?\"\n\"Then your money would be insured by the Great Bank of the Soviet Union.\"\n\"And if that bank fails?\"\n\"Well, in that case, you'd lose all your money. But, wouldn't it be worth it?\"\n"}, {"text": "Seven habits that help produce the anything-but-efficient markets that rule the world by Paul Krugman in Fortune.\n1. Think short term.\n2. Be greedy.\n3. Believe in the greater fool\n4. Run with the herd.\n5. Overgeneralize\n6. Be trendy\n7. Play with other people's money\n"}, {"text": "Phelson's Law (or so I was told)\nCopying an idea from an author is plagiarism. Copying many ideas from many authors is... research !! \n"}, {"text": "How to do research\nKeep the ass to the chair.\n-James Buchanan\n"}, {"text": "Everything has been thought before, but the problem is to think of it again.\n-Goethe\n"}, {"text": "Concepts without perceptions are empty; perceptions without concepts are blind.\n-Kant\n"}, {"text": "Mathematics has no symbols for confused ideas.\n-George Stigler\n"}, {"text": "All models are wrong but some are useful.\n-George Box\n"}, {"text": "Far better an approximate answer to the right question, which is often vague, than an exact answer to the wrong question, which can always be made precise.\n-J. Tukey\n"}, {"text": "The paradox is now fully established that the utmost abstractions are the true weapons with which to control our thought of concrete fact.\n-A. Whitehead\n"}, {"text": "In the long-run, there's just another short-run.\n-Abba Lerner\n"}, {"text": "Life can only be understood backwards, but it must be lived forwards.\n-Kierkegaard\n"}, {"text": "Someone once said about partisan analysts that they use economic data the way a drunkard uses a lamppost: for support rather than illumination. Or as Disraeli put it, there are three kinds of lies: lies, damn lies, and statistics.\n-Paul Krugman\n"}, {"text": "Theories are testable where they are least needed, and are not testable where they are most needed.\n-Charles Manski\n"}, {"text": "If you torture the data long enough, Nature will confess.\n-Ronald Coase\n"}, {"text": "There are two things you are better off not watching in the making: sausages and econometric estimates.\n-Edward Leamer\n"}, {"text": "Doing econometrics is like trying to learn the laws of electricity by playing the radio.\n-Guy Orcutt\n"}, {"text": "Any observed statistical regularity will tend to collapse once pressure is placed upon it for control purposes.\n-Charles Goodhart\n"}, {"text": "Time series regression studies give no sign of converging toward the truth.\n-Phillip Cagan\n"}, {"text": "Any time series regression containing more than four independent variables results in garbage\n-Zvi Griliches\n"}, {"text": "Forecasting is like trying to drive a car blindfolded and following directions given by a person who is looking out of the back window\n-Anonymous\n"}, {"text": "Given the choice between Bob Solow and an econometric model to make forecasts, I'd choose Bob Solow; but I'd rather have Bob Solow with an econometric model, than Bob Solow without one\n-Paul Samuelson\n"}, {"text": "Keep in mind the three most important aspects of real data analysis: compromise, compromise, and compromise.\n-Edward Leamer\n"}, {"text": "The four golden rules of econometrics:\n1.Think brilliantly,\n2.Be infinitely creative,\n3.Be outstandingly lucky,\n4.Otherwise, stick to being a theorist\n-David Hendry\n"}, {"text": "A good empirical study requires three components:\n1.A concise and sensible theoretical framework that is related to the questions to be asked,\n2.Reasonably good data, and\n3.An experiment or an event or a set of circumstances that give the data a chance to answer the questions asked. In short, the model needs to be identifiable from the data at hand.\n-Zvi Griliches\n"}, {"text": "Two students of economics at lunch:\nStudent 1\" 'Do you know what are the two most important degrees in economics?\"\nStudent 2:\"The MSc and the PhD?\" Student 1:\"No, the zeroth and the first!\" \n"}, {"text": "In explaining why she felt our relationship had problems, a former girlfriend (an English teacher) told me that the problem was that I was so ... so ... reasonable. (David Colander) \n"}, {"text": "With simultaneous low inflation and low unemployment in the US persisting for some time, certain policy-makers at the Fed are beginning to think NAIRU stands for Nothing About Inflation (is) Related (to) Unemployment.\n- Chris Varvares (September 2000)\n"}, {"text": "A true story:\nA game theorist was talking to a group of psychologists at a conference. The conversation turned to children. He said that he does not intend his children to get any money from him now that they are grown. \"In fact, if I have so much as a penny to my name on the day I die, it will only be because I miscalculated my utility.\"\n"}, {"text": "In the Soviet Union, Stalin asked the Minister of Finance to give him an advice as to the establishment of the ruble convertibility. The minister produced a thick document, arguing in favor of establishment the rate 1 dollar = 14 rubles. Stalin looked at it and did not like that ruble is so undervalued. He took his red pencil and eliminated \"1\". The exchange rate was established at 1 dollar = 4 rubles.\n"}, {"text": "An economics journal article should be like a woman's skirt: short enough to be provocative; long enough to have something substantial underneath.\n- Gerard Debreu \n"}, {"text": "A student was sitting in an econometric class taught by Prof White. The lecture was too difficult that few students understood it.\n \"What is the lecture all about?\" A student asked his friend who was sitting right next to him.\n\"I don't quite understand it either. All I get is, it's just some noise...specifically, white noise. He said we can expect it to be nothing on average.\" \n"}, {"text": "When doctors make mistakes, at least they kill their patients. When economists make mistakes, they merely ruin them.\n"}, {"text": "An economist is someone who has had a human being described to him, but has never actually seen one.\n"}, {"text": "There are three sorts of economist. Those who can count, and those who can't.\n"}, {"text": "Grow your own dope -- plant an economist.\n"}, {"text": "Economic forecasters assume everything, except responsibility.\n"}, {"text": "Economics is to be found in the library -- beyond fiction.\n"}, {"text": "You know the difference between a dead economist and a dead cat. There are usually skid marks in front of the dead cat.\n"}, {"text": "I begin with the assumption that economists have their uses. I know many of you will disagree with this, but as economists themselves say, 'we can relax the assumption later'.\n"}, {"text": "Several academics are asked whether all odd numbers are prime:p> Mathematician: let's see...3 is prime, 5 is prime, and the result follows by induction.\nPhysicist: let's see...3 is prime, 5 is prime, 7 is prime, 9 is -- experimental error, 11 is prime, 13 is prime, ...\nEngineer: let's see...3 is prime, 5 is prime, 7 is prime, 9 is prime, 11 is prime...\nComputer Scientist: let's see...3 is prime, 3 is prime, 3 is prime...\nEconomist: let's see...2 is prime, 4 is prime, 6 is prime...\n"}, {"text": "An econometrician E.M. left his office after a long day of doing estimations. When arriving at the parking lots, he could not find his car because he could not remember the exact place where he left it. After pondering a while, he stopped at an empty lot and started cursing, \"they stole my car, those bloody bandits\". He called in the police who started taking notes after arrival. A friend from the history department passed along. After listening to what had happened he said, \"hey, your car is 25 meters over there, didn't you realize?\" The econometrician said, \"Can't be, this is the mean value of the distribution of my past choices of lots\".\n"}, {"text": "\"I once read about a meeting of economists who agreed that if their forecasts were 33 1/3 % correct, that was considered a high mark in their profession. Well, of course, I know you cannot invest in securities successfully with odds like that against you if you place dependence solely upon judgement as to the right securities to own and the right time or price to buy them. Then, too, I read somewhere about the man who described an economist as resembling 'a professor of anatomy who was still a virgin.'\"\n-Gerald M Loeb (1935, 1965 ed.) \"The Battle for Investment Survival\"\n"}, {"text": "Economics-everything we know in a language we don't understand.\n"}, {"text": "A voice from history.\n \"Not all Germans believe in God but they believe in the Bundesbank\"\n Jacques Delors former president of European Commission\nin FT December 15,1998 \n"}, {"text": "A real story\n One day, the professor who taught Money and Banking in Buenos Aires told us: \"I do not know if you will find a job as economists, but am sure you will know why you are going to be poor\" \n"}, {"text": "Overheard in passing: one Oxford economics don speaking to another while walking along a street: \"And ninthly, ...\"\nfrom Albert Clack in London.\n"}, {"text": "An economics limerick\n Folks came from afar just to see\nTwo Economists who'd agreed to agree.\nWhile the event did take place,\nIt proved a disgrace;\nThey agreed one plus one adds to three.\n Robley E. George\n"}, {"text": "A joke on the streets of Moscow these days, according to World Bank staffer John Nellis, goes this way: \"Everything the Communists told us about communism was a complete and utter lie. Unfortunately, everything the Communists told us about capitalism turned out to be true.\" \n"}, {"text": "A Scorpion begged a Frog to carry him across the river because he could not swim. The Frog hesitated for fearing being stung by the Scorpion. The Scorpion said: \"Don't worry, you know I won't sting you since we will both get drowned if I do that\". So the Frog carried Scorpion across the river. But in the middle of the river, it happened--the Frog got a sting. Before he died, the Frog asked Scorpion in disbelief: \"I don't understand why you did this!?\" \"Because I am not a game theorist and you are\", replied the Scorpion.\n"}, {"text": "A real story\n Last year at the SEA meetings in Baltimore, I was in the elevator and witnessed the following: the elevator gets to the lobby, and there is a woman (economist) waiting to get in and a man (economist) waiting to get out. The woman pauses to allow the man to exit first, the man pauses to allow the woman to enter the elevator first. After a couple of seconds of just standing there, they both make a move for the door - but as each sees the other moving, they pause again to allow the other to go first. More standing still occurs until finally the door starts to close. The man in the elevator jabs his arm out at the last instant to prevent the doors from closing, and the two stumble past each other as they simultaneous switch places. The door finally closes, and as the elevator starts to move the economist is heard to say, under her breath, \"Manners are never optimal.\"\n- Edward Bierhanzl\n"}, {"text": "A joke told at Kobe University\n The new theorem was published and it aroused discussion.\nEnglish : \"Can you make this theorem base on some experiences?\"\nGerman : \"Can you make this theorem base on some basic theorems?\"\nFrench : \"Can you make this theorem translate into French?\"\nJapanese : \"Is your teacher a famous professor?\"\n"}, {"text": "INTEREST GROUP ECONOMIST VIRUS - Divides your hard disk into hundreds of little units, each of which does practically nothing, but all of which claim to be the most important part of the computer.\nECONOMETRICIAN VIRUS - Sixty percent of the PCs infected will lose 38 percent of their data 14 percent of the time (plus or minus a 3.5 percent margin of\nPOLITICAL THINK TANK ECONOMIST VIRUS - Doesn't do anything, but you can't get rid of it until next election.\nGOVERNMENT ECONOMIST VIRUS - nothing works on your system, but all your diagnostic software says everything is just fine.\nMARXIAN ECONOMIST VIRUS - Helps your computer shut down whenever it wants to.\nSOVIET ECONOMIST VIRUS - Crashes your computer, but denies it ever happened.\nMAINSTREAM ECONOMIST VIRUS - It claims it feels threatened by the other files on your PC and erases then in \"self-defense.\"\nCENTRAL BANK ECONOMIST VIRUS - Makes sure that it's bigger than any other file.\nMULTINATIONAL CORPORATION ECONOMIST VIRUS - Deletes all monetary files, but keeps smiling and sending messages about how the economy is going to get better.\nSUPPLY SIDE ECONOMIST VIRUS - Puts your computer to sleep for four years. When your computer wakes up, you're trillion more dollars in debt.\nNEW ECONOMY VIRUS - Also known as the \"Tricky Dick Virus.\" You can wipe it out, but it always makes a comeback.\nENVIRONMENTAL ECONOMIST VIRUS - Before allowing you to delete any file, it first asks you if you've considered the alternatives.\n"}, {"text": "Two economists sit down to play chess. They study the board for 24 hours and declare a stale-mate. \n"}, {"text": "A friend of mine was taking a class by Milton Friedman at the U of Chicago, and after a late night studying fell asleep in class. This sent Friedman into a little tizzy and he came over and pounded on the table, demanding an answer to a question he had just posed to the class, my friend, shaken but now awake said \" I'm sorry Professor, I missed the question but the answer is increase the money supply.\"\nWe love it on the floor of the CBOT. \n"}, {"text": "What does it take to be a good economist? An unshakeable grasp of the obvious! \n"}, {"text": "\" I have come to appreaciate how Monetarists view the holiness of this principle ['Friedman's x% rule'] by watching Friedman advising on the appropriate monetary policy in diverse complex situations and each time coming up, unfailingly, with the same practical answer: 3 percent.\"\n-Franco Modigliani\nContemporary Policy Issues (1988)  \n"}, {"text": "Robert M. Solow, addressing other economists on the Theory of Capital in 1962, \"I have long since abandoned the illusion that participants in this debate actually communicate with one another. So I omit the standard polemical introduction, and get down to business at once.\" It's good to see an empirical economic discovery that has stood the test of time.\nIntroductory lines to his \"In the Theory of Capital\", XXIV (June 1962), 207-218, Review of Economic Studies. \n"}, {"text": "Heard at the University of Oslo campus\nWe all know what pareto optimal allocation means... What about Jesus-optimal allocation -- when all persons are equally well off, and one person _really_ gets it bad, worse off, while all the rest are much better off... \n"}, {"text": "Dostojevskij-minimum: When everyone is so bad off that no-one can be worse off without anyone getting better off. (Beware of the second-order condition!) \n"}, {"text": "Achieving free trade is like getting to heaven. Everyone one wants to get there, but not too soon. \n"}, {"text": "Value of human capital\nEngineers and scientists will never make as much money as business executives. Now a rigorous mathematical proof that explains why this is true:\nPostulate 1: Knowledge is Power.\nPostulate 2: Time is Money.\nAs every engineer knows,\nWork / Time = Power\nSince Knowledge = Power, and Time =Money, we have\nWork / Money = Knowledge\nSolving for Money, we get:\nWork / Knowledge = Money\nThus, as Knowledge approaches zero, Money approaches infinity regardless of the Work done.\nConclusion: The Less you Know, the more money you Make.\n"}, {"text": "A traveller wandering on an island inhabited entirely by cannibals comes upon a butcher shop. This shop specialised in human brains differentiated according to source. The sign in the shop read:\nArtists' Brains $9/lb\nPhilosophers' Brains $12/lb\nScientists' Brains $15/lb\nEconomists' Brains $19/lb\nUpon reading the sign, the traveller noted, \"My those economists' brains must be popular!\" To which the butcher replied, \"Are you kidding! Do you have any idea how many economists you have to kill to get a pound of brains?!\"\nHA! ... It's a *supply side* joke!\n"}, {"text": "President Truman once said he wants an economic adviser who is one handed. Why? Because normally the economists giving him economic advice state \"On one hand and on the other...\" \n"}, {"text": "The Commerce Department has a 46-page application packet for economists to seeking to run its leading economic index, but the packet warns: \"the government will evaluate only the first 25 pages of a written proposal.\"\nThe Wall Street Journal, July 21, 1995 \n"}, {"text": "In Canada there is a small radical group that refuses to speak english and no one can understand them. They are called separatists. In this country (USA) we have the same kind of group. They are called economists.\nNation's Business \n"}, {"text": "An economist was asked about the meaning of life. He replied:\nIt depends on the parameter values. \n"}, {"text": "On the first day God created the sun - so the Devil countered and created sunburn. On the second day God created sex. In response the Devil created marriage. On the third day God created an economist. This was a tough one for the Devil, but in the end and after a lot of thought he created a second economist!\nCHEER February 1993 \n"}, {"text": "Three leading economists took a small plane to the wilderness in northern Canada to hunt moose over the weekend. The last thing the pilot said was , remember, this is a very small plane and you will only be able to bring ONE moose back.\nBut of course, they killed one each and come sunday, they talked the pilot into letting them bring all three dead moose onboard. So just after takeoff, the plane stalled and crashed. In the wreckage, one of the economists woke up, looked around and said. where the hell are we. Oh, just about a hundred yards east of the place there we crashed last year. \n"}, {"text": "\"Economic man\" never gets a hang-over, if he doesn't decide that the advantages of acquiring it exceed the draw-backs. \n"}, {"text": "Everybody has a comparative advantage in some respect, provided that performances are not entirely in the third quadrant. \n"}, {"text": "\"This man is a first year economics student, so we can't show you his friends.\" - Tim Ferguson, DAAS Farewell Tour, 1994 \n"}, {"text": "An Economist is someone who didn't have enough personality to become an accountant. \n"}, {"text": "An economist is someone who knows 100 ways to make love, but doesn't know any women/men. \n"}, {"text": "Q: What is a recent economics graduate's usual question in his first job?\nA: What would you like to have with your french fries sir? \n"}, {"text": "An economist returns to visit his old school. He's interested in the current exam questions and asks his old professor to show some. To his surprise they are exactly the same ones to which he had answered 10 years ago! When he asks about this the professor answers: \"the questions are always the same - only the answers change!\" \n"}, {"text": "Economics is extremely useful as a form of employment for economists. \n"}, {"text": "A central banker walks into a pizzeria to order a pizza.\nWhen the pizza is done, he goes up to the counter get it. There a clerk asks him: \"Should I cut it into six pieces or eight pieces?\"\nThe central banker replies: \"I'm feeling rather hungry right now. You'd better cut it into eight pieces.\"\n"}, {"text": "Reproduced below is an Economist Joke that illustrates the separate facilities solution to an externality problem.\nThree guys decide to play a round of golf: a priest, a psychologist, and an economist.\nThey get behind a *very* slow two-some, who, despite a caddy, are taking all day to line up their shots and four-putting every green, and so on. By the 8th hole, the three men are complaining loudly about the slow play ahead and swearing a blue streak, and so on. The priest says, \"Holy Mary, I pray that they should take some lessons before they play again.\" The psychologist says, \"I swear there are people that like to play golf slowly.\" The economist says, \"I really didn't expect to spend this much time playing a round of golf.\"\nBy the 9th hole, they have had it with slow play, so the psychologist goes to the caddy and demands that they be allowed to play through. The caddy says O.K., but then explains that the two golfers are blind, that both are retired firemen who lost their eyesight saving people in a fire, and that explains their slow play, and would they please not swear and complain so loud.\nThe priest is mortified; he says, \"Here I am a man of the cloth and I've been swearing at the slow play of two blind men.\" The psychologist is also mortified; he says, \"Here I am a man trained to help others with their problems and I've been complaining about the slow play of two blind men.\"\nThe economist ponders the situation-finally he goes back to the caddy and says, \"Listen, the next time could they play at night.\"\n"}, {"text": "A physicist, a chemist and an economist are stranded on an island, with nothing to eat. A can of soup washes ashore. The physicist says, \"Lets smash the can open with a rock.\" The chemist says, \"Lets build a fire and heat the can first.\" The economist says, \"Lets assume that we have a can-opener...\"\nPaul Samuelson \n"}, {"text": "Q: What's the difference between a finance major and an economics major?\nA: Opportunity Cost\n"}, {"text": "An economist, a philosopher, a biologist, and an architect were were arguing about what was God's real profession. The philosopher said, \"Well, first and foremost, God is a philosopher because he created the principles by which man is to live.\" \"Ridiculous!\" said the biologist \"Before that, God created man and woman and all living things so clearly he was a biologist.\" \"Wrong,\" said the architect. \"Before that, he created the heavens and the earth. Before the earth, there was only complete confusion and chaos!\" \"Well,\" said the economist, \"where do you think the chaos came from?\"\n"}, {"text": "The First Law of Economists: For every economist, there exists an equal and opposite economist.\nThe Second Law of Economists: They're both wrong.\npkm's existence theorem: for every finite set of answers there exists an infinite set of novel models \n"}, {"text": "If all the economists were laid end to end\na) it would be a good thing\nb) they would be more comfortable\nc) they would never reach conclusion\nd) all of the above\ne) none of the above\nf) they would point in different directions \n"}, {"text": "Two economists are walking down the street. One sees a dollar lying on the sidewalk, and says so.\n\"Obviously not,\" says the other. \"If there were, someone would have picked it up!\"\nPS. Replace the dollar with a relevant research idea and you get a new joke. \n"}, {"text": "We have 2 classes of forecasters: Those who don't know . . . and those who don't know they don't know.\n- John Kenneth Galbraith\n"}, {"text": "The experience of being proved completely wrong is salutory. No economist should be denied it, and none are.\n- J K Galbraith\n"}, {"text": "\"Murphys law of economic policy\": Economists have the least influence on policy where they know the most and are most agreed; they have the most influence on policy where they know the least and disagree most vehemently.\n- Alan S. Blinder \n"}, {"text": "An economist is an expert who will know tomorrow why the things he predicted yesterday didn't happen today.\n- Laurence J. Peter \n"}, {"text": "A study of economics usually reveals that the best time to buy anything is last year.\n- Marty Allen \n"}, {"text": "Having a little inflation is like being a little pregnant--inflation feeds on itself and quickly passes the \"little\" mark.\n- Dian Cohen \n"}, {"text": "I don't think you can spend yourself rich.\n- George Humphrey \n"}, {"text": "If all economists were laid end to end they would not reach a conclusion.\n- George Bernard Shaw \n"}, {"text": "Practical men ... are usually the slaves of some defunct economist. economist\n- John Maynard Keynes \n"}, {"text": "If you put two economists in a room, you get two opinions, unless one of them is Lord Keynes, in which case you get three opinions.\n- Winston Churchill \n"}, {"text": "Shall I tell you the opinion of a famous economist on jealousy? Jealousy is just the fact of being deprived. Nothing more.\n- Henry Becque \n"}, {"text": "Stephen M. Goldfeld, in _The Journal of Money, Credit and Banking_. November, 1984, p. 611: \"An economist is someone who sees something working in practice and asks whether it would work in principle.\" \n"}, {"text": "Economists don't answer to questions others make because they know what the answer is. They answer because they are asked.\n"}, {"text": "There is also a joke about the last Mayday parade in the Soviet Union. After the tanks and the troops and the planes and the missiles rolled by there came ten men dressed in black.\n\"Are they Spies?\" Asked Gorby?\n\"They are economists,\" replies the KGB director, \"imagine the havoc they will wreak when we set them loose on the Americans\"\n"}, {"text": "The mathematician's child and the economist's child were in the third grade together, and the teacher asked, \"If one man with one shovel can dig a ditch in ten days, how long would it take ten men with ten shovels to dig the same ditch?\" Both children raised their hands.\nThe teacher said to the mathematician's child, \"Johnny, how long?\" and little Johnny v. said, \"One day, teacher.\"\nThe teacher looked at the economist's child and said, \"John Maynard, is that right?\"\nLittle John Maynard said, \"Teacher, it all depends.\"\n"}, {"text": "Most of the following jokes were forwarded to me by Russell Gum to whom I owe a big thanks.\n\"Having a house economist became for many business people something like havinga resident astrologer for the royal court: I don't quite understand what this fellow is saying but there must be something to it.\" Linden. (Jan. 11, 1993). Dreary Days in the Dismal Science. Forbes. Pp. 68-70.\n"}, {"text": "The following joke is a joint invention of Preston McAfee, Phil Reny and several so far anonymous writers.\nWhy God Never Received Tenure at the University\n1. Because he had only one major publication.\n2. And it was in Hebrew.\n3. And it had no cited references.\n4. And it wasn't published in a refereed journal or even submitted for peer review.\n5. And some even doubt he wrote it himself.\n6. It may be true that he created the world but what has he done since?\n7. His cooperative efforts have been quite limited.\n8. The scientific community has had a very rough time trying to replicate his results.\n9. He never applied to the Ethics Board for permission to use human subjects.\n10. When one experiment went awry, he tried to cover it up by drowning the subjects.\n11. When subjects didn't behave as predicted, he often punished them, or just deleted them from the sample.\n12. He rarely came to class, just told students to read the book.\n13. He had his son teach the class.\n14. He expelled his first two students for learning.\n15. Although there were only ten requirements, most students failed his tests.\n16. His office hours were infrequent and usually held on a mountain top.\n"}, {"text": "A sure fire way to determine if someone is an economist: Ask the suspect \"what's the difference between ignorance and indifference?\" If the reply is \"I don't know and I don't care\" you can be pretty sure its an economist. Now the only question is what to do with him. \n"}, {"text": "If an economist and an IRS agent were both drowning and you could only save one of them, would you go to lunch or read the paper? \n"}, {"text": "The National Institute of Health (NIH) announced that they were going to start using economists instead of rats in their experiments. Naturally, the American Agricultural Economics Association was outraged and filed suit, but NIH presented some compelling reasons for the switch:\n1) NIH lab assistants become very attached to their rats. This emotional involvement was interfering with the research being conducted. No such attachment could form for an economist.\n2) Economists breed faster.\n3) Economists are much cheaper to care for and PETA won't object regardless of the experiment.\n4) There are some things even rats won't do.\nHowever, it is difficult to extrapolate test results to human beings. \n"}, {"text": "How many economists does it take to screw in a light bulb?\n1. Just one, but it really gets screwed.\n2. One to prepare the proposal, an econometrician to run the model, one each MS and PhD students to write the theses and dissertations, two more to prepare the journal article (senior authorship not assigned), four to review it, and at least as many to refine the model and replicate the results. \n"}, {"text": "Why do economists carry their diplomas on their dashboards?\nSo they can park in the (morally/intellectually) handicapped parking. \n"}, {"text": "A guy walks into a DC curio shop. While browsing he comes across an exquisite brass rat. \"What a great gag gift\" he thinks to himself. After dickering with the shop keeper over the price, the man purchases the rat and leaves. As he's walking down the street, he hears scurrying noises behind him. Stopping and looking around, he sees hundreds, then thousands of rats pouring out of the alleys and stairwells into the street behind him. In a panic he runs down the street with the rats not far behind. The street ends at a pier; he runs to the end of the pier and heaves the brass rat into the Potomac. All of the rats scurry past him into the river where they drown. After breathing a sigh of relief and wiping his brow, the man heads back to the curio shop, finds the shop keeper and asks, \"Do you have any brass economists?\" \n"}, {"text": "TEN THINGS TO DO WITH A GRADUATE ECONOMICS TEXTBOOK\n1. Press pretty flowers.\n2. Press pretty insects.\n3. Use it as paper weight on your already overcluttered desk.\n4. Leave out in obvious places to impress uninformed undergraduates.\n5. Mail to the White House as an intimidation tactic.\n6. Give it a walk-on part in a boring European existentialist play.\n7. Just throw the damn thing away.\n8. Leave out for the rain and other forces of nature to reckon with.\n9. Read it (ha ha ha), and weep.\n10. Get a refund from bookstore so you can buy weekend's beer supply. \n"}, {"text": "How can you tell when an economist is lying?\nHis lips are moving. \n"}, {"text": "Why won't sharks attack economists?\nProfessional courtesy.\n"}, {"text": "Q: What do you get when you cross the Godfather with an economist?\nA: An offer you can't understand. \n"}, {"text": "Q: How many economists does it take to change a light bulb?\nA: Hell, you need a whole department of them just to prepare the research grant. \n"}, {"text": "They say that Christopher Columbus was the first economist. When he left to discover America, he didn't know where he was going. When he got there he didn't know where he was. And it was all done on a government grant. \n"}, {"text": "A grade school teacher was asking students what their parents did for a living. \"Tim, you be first. What does your mother do all day?\"\nTim stood up and proudly said, \"She's a doctor.\"\n\"That's wonderful. How about you, Amy?\"\nAmy shyly stood up, scuffed her feet and said, \"My father is a mailman.\"\n\"Thank you, Amy\" said the teacher. \"What does your parent do, Billy?\"\nBilly proudly stood up and announced,\n1. \"Nothing. He's an economist.\"\n2. \"My daddy plays piano in a whorehouse.\" The teacher was aghast and went to Billy's house and rang the bell. Billy's father answered the door. The teacher explained what his son had said and demanded an explanation. Billy's dad said, \"I'm actually an economist. How can I explain a thing like that to a seven-year-old?\" \n"}, {"text": "A Berkeley economist died and went to heaven (No, that's not the joke). There were thousands of people ahead of him in line to see St. Peter. To his surprise, St. Peter left his desk at the gate and came down the long line to where the economist was, and greeted him warmly. St. Peter took the economist up to the front of the line, and into a comfortable chair by his desk. The economist said, \"I like all this attention, but what makes ME so special?\" St. Peter replied, \"Well, I've added up all the hours for which you billed your consultation clients, and by my calculation you're 193 years old!\" \n"}, {"text": "A Chicago economist died in poverty and many local futures traders donated to a fund for his funeral. The president of (the Merc, the Board of Trade, etc.) was asked to donate a dollar. \"Only a buck?\" said the president, \"only a dollar to bury an economist? Here's a check; go bury 1000 of them.\" \n"}, {"text": "An economist and a physician had a dispute over precedence. They referred it to Diogenes, who gave it in favor of the economist as follows: \"Let the thief go first, and the executioner follow.\" \n"}, {"text": "What's the difference between mathematics and economics?\nMathematics is incomprehensible; economics just doesn't make any sense. \n"}, {"text": "A judge was hearing a drunk-driving case and the defendant, who had both a record and a reputation for driving under the influence, demanded a jury trial. It was nearly 4 p.m. and getting a jury would take time, so the judge called a recess and went out in the hall looking to empanel anyone available. He found a dozen economists and told them that they were a jury. The economists thought this would be a novel experience (none had ever been at a trial before, except as a defendent or an expert witness) and followed the judge into the courtroom. The trial was over in about 10 minutes and it was very clear that the defendant was guilty. The jury went into the jury-room, the judge started getting ready to go home, and everyone waited. After three hours, the judge sent the bailiff into the jury- room to see what was holding up the verdict. When the bailiff returned, the judge said, \"Well, have they arrived at a verdict yet?\" The bailiff shook his head and said, \"Verdict? Hell, Judge, they're still doing nominating speeches for the foreman's position!\" \n"}, {"text": "For three years, the young assistant professor took his vacations at a country inn. He had an affair with the innkeeper's daughter. Looking forward to an exciting few days, he dragged his suitcase up the stairs of the inn, then stopped short. There sat his lover with an infant on her lap! \"Why didn't you write when you learned you were pregnant?\" he cried. \"I would have rushed up here, we could have gotten married, and the child would have my name!\" \"Well,\" she said, \"when my folks found out about my condition, we sat up all night talkin' and talkin' and we finally decided it would be better to have a bastard in the family than an economist.\" \n"}, {"text": "Santa Claus, the tooth fairy, a practical economist, and an old drunk are walking down the street together when they simultaneously spot a hundred dollar bill. Who gets it? The old drunk, of course, the other three are mythological creatures. \n"}, {"text": "A Harvard economist had a summer house in the Maine woods. Each summer he'd invite a different friend (no, that's not the punch line) to spend a week or two. On one occasion, he invited a Czechoslovakian to stay with him. They had a splendid time in the country - rising early and living in the great outdoors. Early one morning they went out to pick berries for their morning breakfast. As they went around the berry patch along came two huge bears. The economist dashed for cover. His friend wasn't so lucky and the male bear reached him and swallowed him whole. The economist ran back to his car, drove to town as fast has he could, and got the sheriff. The sheriff grabbed his rifle and dashed back to the berry patch with the economist. Sure enough, both bears were still there. \"He's in THAT one!\" cried the economist, pointing to the male. The sheriff looked at the bears, and without batting an eye, leveled his gun, took careful aim, and SHOT THE FEMALE. \"Whatd'ya do that for?!\" exclaimed the economist, \"I said he was in the other!\" \"Yep,\" said the sheriff, \"and would YOU believe a economist who told you that the Czech was in the Male?\" \n"}, {"text": "WASHINGTON DC GOVERNMENT ECONOMIST HUNTING REGULATIONS AND BAG LIMITS\nGENERAL\n1. Any person with a valid Washington DC hunting license or a Federal Income Tax Return may harvest government economists.\n2. Taking of economists with traps or deadfalls is permitted. The use of currency as bait is prohibited.\n3. Killing of economists with a vehicle is prohibited. If one is accidentally struck, remove the dead economist to side of the road and proceed to the nearest car wash.\n4. It is unlawful to chase, herd, or harvest economists from limousines, Mercedes Benz's, the Metro, or Porsches.\n5. It shall be unlawful to shout \"research contract\" or \"I need a policy consultant\" for the purpose of trapping economists.\n6. It shall be unlawful to hunt economists within 100 feet of government buildings.\n7. It shall be unlawful to use decision memos, draft legislation, conference reports, or RFP's to attract economists.\n8. It shall be unlawful to hunt economists within 200 feet of Senate or House hearing rooms, libraries, whorehouses, massage parlors, special interest group offices, bars, or strip joints.\n9. If an economist is elected to government office, it shall be a felony to hunt, trap, or possess it. It will also be a shame.\n10. Stuffed or mounted economists must have a DC Health Department inspection certificate for rabies and vermin.\n11. It shall be illegal for a hunter to disguise as a reporter, drug dealer, pimp, female congressional aid, sheep, legislator, policy maker, bookie, lobbyist, or tax accountant for the purpose of hunting economists.\n"}, {"text": "BAG LIMITS\n1. Econometrician: 2\n2. Two-faced Policy Analyst: 1\n3. Macro Policy Wonk: 4\n4. Big-mouthed Populist: 2\n5. Relevant Economist: EXTINCT\n6. Cut-throat Administration Seeker: 2\n7. Back-stabbing Senior Author: 2\n8. Brown-nosed Deputy Kisser: 2\n9. Silver-tongued Congressional Consultant:; $100 BOUNTY\n10. Wise-assed CivilLibertarian: 7 11. Staff economist: NO LIMIT\n"}, {"text": "Given 1000 economists, there will be 10 theoretical economists with different theories on how to change the light bulb and 990 empirical economists laboring to determine which theory is the *correct* one, and everyone will still be in the dark.\n"}, {"text": "After running many regressions a professor have discovered the the nation's output of soybeans followed a semi-logarithmic production function. He has just finished writing up his paper when on a visit to the office of the bureaucrat in charge of soybean statistics he noticed a sign which read: \"When in Doubt Use the Semi-Log\".\n(from Peter Kennedy, A Guide to Econometrics, MIT Press, 1992, p.145)\n"}, {"text": "1. The data are not that bad\n2. The data are lousy but it doesn't matter\n3. The data are bad but we have learned how to live with them and adjust their foibles\n4. That is all there is â€” it is the only game in town and we have to make the best of it\n(Zvi Griliches, \"Data and Econometricians â€” the Uneasy Alliance,\" American Economic Review, 74 (May, 1985)\n"}, {"text": "An economist is a trained professional paid to guess wrong about the economy. An econometrician is a trained professional paid to use computers to guess wrong about the economy.\n"}, {"text": "Three econometricians went out hunting, and came across a large deer. The first econometrician fired, but missed, by a meter to the left. The second econometrician fired, but also missed, by a meter to the right. The third econometrician didn't fire, but shouted in triumph, \"We got it! We got it!\"\n"}, {"text": "A mathematician, a theoretical economist and an econometrician are asked to find a black cat (who doesn't really exist) in a closed room with the lights off:\n- The mathematician gets crazy trying to find a black cat that doesn't exist inside the darkened room and ends up in a psychiatric hospital.\n- The theoretical economist is unable to catch the black cat that doesn't exist inside the darkened room, but exits the room proudly proclaiming that he can construct a model to describe all his movements with extreme accuracy.\n- The econometrician walks securely into the darkened room, spend one hour looking for the black cat that doesn't exits and shouts from inside the room that he has it catched by the neck.\"\n"}, {"text": "I asked an economist for her phone number... and she gave me an estimate.\n"}, {"text": "From Peter Kennedy's \"A Guide to Econometrics\" (MIT Press, 1992):\n(P. 7) [Econometrics is...] the art of drawing a crooked line from an unproved assumption to a foregone conclusion.\"\n"}, {"text": "Far better an approximate answer to the right question, which is often vague, than an exact answer to the wrong question, which can always be made precise.\n-J. Tukey\n"}, {"text": "Theories are testable where they are least needed, and are not testable where they are most needed.\n-Charles Manski\n"}, {"text": "If you torture the data long enough, Nature will confess.\n-Ronald Coase\n"}, {"text": "Doing econometrics is like trying to learn the laws of electricity by playing the radio.\n-Guy Orcutt\n"}, {"text": "Any observed statistical regularity will tend to collapse once pressure is placed upon it for control purposes.\n-Charles Goodhart\n"}, {"text": "Time series regression studies give no sign of converging toward the truth.\n-Phillip Cagan\n"}, {"text": "Any time series regression containing more than four independent variables results in garbage\n-Zvi Griliches\n"}, {"text": "Forecasting is like trying to drive a car blindfolded and following directions given by a person who is looking out of the back window\n-Anonymous\n"}, {"text": "Given the choice between Bob Solow and an econometric model to make forecasts, I'd choose Bob Solow; but I'd rather have Bob Solow with an econometric model, than Bob Solow without one\n-Paul Samuelson\n"}, {"text": "Keep in mind the three most important aspects of real data analysis: compromise, compromise, and compromise.\n-Edward Leamer\n"}, {"text": "The four golden rules of econometrics:\n1.Think brilliantly,\n2.Be infinitely creative,\n3.Be outstandingly lucky,\n4.Otherwise, stick to being a theorist\n-David Hendry\n"}, {"text": "A good empirical study requires three components:\n1.A concise and sensible theoretical framework that is related to the questions to be asked,\n2.Reasonably good data, and\n3.An experiment or an event or a set of circumstances that give the data a chance to answer the questions asked. In short, the model needs to be identifiable from the data at hand.\n-Zvi Griliches\n"}, {"text": "A student was sitting in an econometric class taught by Prof White. The lecture was too difficult that few students understood it.\n\"What is the lecture all about?\" A student asked his friend who was sitting right next to him.\n\"I don't quite understand it either. All I get is, it's just some noise... specifically, white noise. He said we can expect it to be nothing on average.\"\n"}, {"text": "An econometrician E.M. left his office after a long day of doing estimations. When arriving at the parking lots, he could not find his car because he could not remember the exact place where he left it. After pondering a while, he stopped at an empty lot and started cursing, \"they stole my car, those bloody bandits\". He called in the police who started taking notes after arrival. A friend from the history department passed along. After listening to what had happened he said, \"hey, your car is 25 meters over there, didn't you realize?\" The econometrician said, \"Can't be, this is the mean value of the distribution of my past choices of lots\".\n"}]}