<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html><head>
  <title>GochaUgulava GitHub</title>

  
  
  <style>
html,body{margin:0;padding:0}
body {background: url(images/codebg.jpg); }
body{font:  sylfaen, arial,sans-serif;text-align:center}
p{margin:0 10px 10px}
a{display:block;color: #981793;padding:10px}
div#header h1{height:100px;line-height:80px;margin:0;padding-left:10px;background: #EEE;color: rgb(51, 102, 255)}
div#header {margin:0 auto; background: #EEE; color: rgb(51, 102, 255)}
div#container{text-align:left}
div#content {line-height:2;padding:0px 15px;}
div#content {background: #FFF;color: #000}
div#title h1{margin:100px 0px 0px 0px; padding:20px 0px; background: #FFF;color: rgb(51, 102, 255)}
div#footer{background: #333;color: #FFF}
div#footer p{margin:0;padding:5px 10px}
div#container{width:70%;margin:0 auto}
div#footer{clear:both;width:100%}
  </style>
</head><body>
<div id="header">
<table border="0" cellpadding="2" cellspacing="0" width="100%">
  <tbody>
    <tr>
      <td style="text-align: right;"> <br>
      </td>
      <td style="text-align: left;">
      <h1>Gocha Ugulava GitHub</h1>
      </td>
      <td style="text-align: right;">
      <h3><a href="../index.html">&#4315;&#4311;&#4304;&#4309;&#4304;&#4320;&#4310;&#4308; &#4306;&#4304;&#4307;&#4304;&#4321;&#4309;&#4314;&#4304;</a></h3>
      </td>
    </tr>
  </tbody>
</table>
</div>

<div id="container">
<div id="title">
<h1 style="text-align: center;"><img style="border: 0px solid ; width: 100px; height: 100px;" alt="" src="images/git.png" align="middle">
<p><br>
</p>
<p>&#4320;&#4317;&#4306;&#4317;&#4320; &#4306;&#4304;&#4307;&#4315;&#4317;&#4309;&#4332;&#4308;&#4320;&#4317;&#4311; github-&#4307;&#4304;&#4316; &#4307;&#4304; &#4306;&#4304;&#4309;&#4323;&#4328;&#4309;&#4304;&#4311; python &#4311;&#4304;&#4315;&#4304;&#4328;&#4308;&#4305;&#4312;<br>
(Windows &#4317;&#4318;&#4308;&#4320;&#4304;&#4330;&#4312;&#4323;&#4314;&#4312; &#4321;&#4312;&#4321;&#4322;&#4308;&#4315;&#4312;&#4321;&#4304;&#4311;&#4309;&#4312;&#4321;)</p>
</h1>
</div>
<div id="content">
<p><br>
GitHub &#4320;&#4308;&#4318;&#4317;&#4310;&#4312;&#4322;&#4317;&#4320;&#4312;&#4323;&#4315;&#4312;&#4307;&#4304;&#4316; Python &#4311;&#4304;&#4315;&#4304;&#4328;&#4312;&#4321; &#4306;&#4304;&#4307;&#4315;&#4317;&#4321;&#4304;&#4332;&#4308;&#4320;&#4304;&#4307; &#4307;&#4304; &#4306;&#4304;&#4321;&#4304;&#4328;&#4309;&#4308;&#4305;&#4304;&#4307;
&#4328;&#4308;&#4321;&#4304;&#4321;&#4320;&#4323;&#4314;&#4308;&#4305;&#4308;&#4314;&#4312;&#4304; &#4320;&#4312;&#4306;&#4312; &#4315;&#4317;&#4325;&#4315;&#4308;&#4307;&#4308;&#4305;&#4308;&#4305;&#4312;. &#4304;&#4325; &#4304;&#4315; &#4315;&#4317;&#4325;&#4315;&#4308;&#4307;&#4308;&#4305;&#4308;&#4305;&#4321; &#4306;&#4304;&#4316;&#4309;&#4312;&#4334;&#4312;&#4314;&#4304;&#4309;&#4311;
Covid Invasion &#4311;&#4304;&#4315;&#4304;&#4328;&#4312;&#4321; &#4315;&#4304;&#4306;&#4304;&#4314;&#4312;&#4311;&#4310;&#4308;, &#4311;&#4323;&#4315;&#4330;&#4304; &#4321;&#4334;&#4304; &#4328;&#4308;&#4315;&#4311;&#4334;&#4309;&#4308;&#4309;&#4304;&#4328;&#4312;&#4330; &#4325;&#4315;&#4308;&#4307;&#4308;&#4305;&#4308;&#4305;&#4312;
&#4312;&#4307;&#4308;&#4316;&#4322;&#4323;&#4320;&#4312;&#4304;.
<br>
</p>
<hr>
<p>1. &#4309;&#4308;&#4305;-&#4305;&#4320;&#4304;&#4323;&#4310;&#4308;&#4320;&#4312;&#4311; &#4328;&#4308;&#4309;&#4312;&#4311;&#4308;&#4307; &#4328;&#4308;&#4321;&#4304;&#4305;&#4304;&#4315;&#4312;&#4321; GitHub &#4320;&#4308;&#4318;&#4317;&#4310;&#4312;&#4322;&#4317;&#4320;&#4312;&#4323;&#4315;&#4328;&#4312; &#4307;&#4304;
&#4307;&#4304;&#4309;&#4304;&#4332;&#4313;&#4304;&#4318;&#4323;&#4316;&#4317;&#4311; &#4315;&#4332;&#4309;&#4304;&#4316;&#4308; &#4324;&#4308;&#4320;&#4312;&#4321; &#4326;&#4312;&#4314;&#4304;&#4313;&#4310;&#4308; Clone or download.
&#4329;&#4304;&#4315;&#4317;&#4328;&#4314;&#4312;&#4314; &#4315;&#4330;&#4312;&#4320;&#4308; &#4310;&#4317;&#4315;&#4312;&#4321; &#4315;&#4308;&#4316;&#4312;&#4323;&#4328;&#4312; &#4307;&#4304;&#4309;&#4304;&#4332;&#4313;&#4304;&#4318;&#4323;&#4316;&#4317;&#4311; Download ZIP.<br>
&#4304;&#4315; &#4318;&#4320;&#4317;&#4330;&#4308;&#4307;&#4323;&#4320;&#4312;&#4321; &#4306;&#4304;&#4321;&#4304;&#4315;&#4304;&#4320;&#4322;&#4312;&#4309;&#4308;&#4305;&#4314;&#4304;&#4307;, &#4323;&#4324;&#4320;&#4317; &#4312;&#4317;&#4314;&#4312;&#4304;, &#4304;&#4315; &#4321;&#4304;&#4312;&#4322;&#4312;&#4321; &#4311;&#4304;&#4315;&#4304;&#4328;&#4312;&#4321; &#4328;&#4308;&#4321;&#4304;&#4305;&#4304;&#4315;&#4312;&#4321;
&#4306;&#4309;&#4308;&#4320;&#4307;&#4310;&#4308; (&#4306;&#4304;&#4307;&#4304;&#4309;&#4307;&#4312;&#4309;&#4304;&#4320;&#4311; &#4315;&#4311;&#4304;&#4309;&#4304;&#4320;&#4312; &#4306;&#4309;&#4308;&#4320;&#4307;&#4312;&#4307;&#4304;&#4316;) &#4315;&#4317;&#4309;&#4331;&#4312;&#4317;&#4311; &#4318;&#4312;&#4320;&#4307;&#4304;&#4318;&#4312;&#4320;&#4312; &#4305;&#4315;&#4323;&#4314;&#4312; &#4307;&#4304;
&#4315;&#4304;&#4321;&#4310;&#4308; &#4307;&#4304;&#4332;&#4313;&#4304;&#4318;&#4323;&#4316;&#4308;&#4305;&#4312;&#4311; &#4315;&#4312;&#4309;&#4312;&#4326;&#4308;&#4305;&#4311; &#4328;&#4308;&#4307;&#4308;&#4306;&#4321;. &#4317;&#4320;&#4312;&#4309;&#4308; &#4328;&#4308;&#4315;&#4311;&#4334;&#4309;&#4308;&#4309;&#4304;&#4328;&#4312; &#4321;&#4304;&#4312;&#4322;&#4312;&#4307;&#4304;&#4316;
&#4313;&#4317;&#4315;&#4318;&#4312;&#4323;&#4322;&#4308;&#4320;&#4328;&#4312; &#4329;&#4304;&#4315;&#4317;&#4312;&#4322;&#4309;&#4312;&#4320;&#4311;&#4308;&#4305;&#4304; &#4311;&#4304;&#4315;&#4304;&#4328;&#4312;&#4321; &#4304;&#4320;&#4325;&#4312;&#4309;&#4312;&#4320;&#4308;&#4305;&#4323;&#4314;&#4312; ZIP &#4324;&#4304;&#4312;&#4314;&#4312;</p>
<img style="width: 500px;" alt="" src="images/fg1.png" align="middle">
<br>
<hr>
<p>2. &#4305;&#4320;&#4304;&#4323;&#4310;&#4308;&#4320;&#4328;&#4312; &#4324;&#4304;&#4312;&#4314;&#4312;&#4321; &#4329;&#4304;&#4315;&#4317;&#4322;&#4309;&#4312;&#4320;&#4311;&#4309;&#4312;&#4321; &#4307;&#4304;&#4321;&#4320;&#4323;&#4314;&#4308;&#4305;&#4312;&#4321; &#4328;&#4308;&#4315;&#4307;&#4308;&#4306; &#4329;&#4304;&#4315;&#4317;&#4322;&#4309;&#4312;&#4320;&#4311;&#4323;&#4314;&#4312;
&#4324;&#4304;&#4312;&#4314;&#4312;&#4321; &#4315;&#4308;&#4316;&#4312;&#4323;&#4328;&#4312; &#4304;&#4309;&#4312;&#4320;&#4329;&#4312;&#4317;&#4311; Show in folder, &#4320;&#4304;&#4311;&#4304; &#4306;&#4304;&#4309;&#4334;&#4321;&#4316;&#4304;&#4311; &#4312;&#4321; &#4324;&#4317;&#4314;&#4307;&#4308;&#4320;&#4312;,
&#4320;&#4317;&#4315;&#4308;&#4314;&#4328;&#4312;&#4330;&#4304;&#4304; &#4329;&#4304;&#4315;&#4317;&#4322;&#4309;&#4312;&#4320;&#4311;&#4323;&#4314;&#4312; &#4329;&#4309;&#4308;&#4316;&#4312; &#4324;&#4304;&#4312;&#4314;&#4312;</p>
<img style="width: 500px;" alt="" src="images/fg2.png" align="middle">
<br>
<hr>
<p>3. &#4306;&#4304;&#4334;&#4321;&#4316;&#4312;&#4314; &#4324;&#4317;&#4314;&#4307;&#4308;&#4320;&#4328;&#4312; &#4315;&#4317;&#4309;&#4316;&#4312;&#4328;&#4316;&#4317;&#4311; &#4329;&#4304;&#4315;&#4317;&#4322;&#4309;&#4312;&#4320;&#4311;&#4323;&#4314;&#4312; &#4324;&#4304;&#4312;&#4314;&#4312;, &#4315;&#4312;&#4321; &#4313;&#4317;&#4316;&#4322;&#4308;&#4325;&#4321;&#4322;&#4323;&#4320;
&#4315;&#4308;&#4316;&#4312;&#4323;&#4328;&#4312; (&#4320;&#4317;&#4315;&#4308;&#4314;&#4312;&#4330; &#4306;&#4304;&#4315;&#4317;&#4312;&#4322;&#4304;&#4316;&#4308;&#4305;&#4304; &#4324;&#4304;&#4312;&#4314;&#4310;&#4308; &#4315;&#4304;&#4323;&#4321;&#4312;&#4321; &#4315;&#4304;&#4320;&#4335;&#4309;&#4308;&#4316;&#4304; &#4326;&#4312;&#4314;&#4304;&#4313;&#4310;&#4308;
&#4307;&#4304;&#4332;&#4313;&#4304;&#4318;&#4323;&#4316;&#4308;&#4305;&#4312;&#4321;&#4304;&#4321;) &#4304;&#4309;&#4312;&#4320;&#4329;&#4312;&#4317;&#4311; &#4318;&#4323;&#4316;&#4325;&#4322;&#4312; Cut (&#1042;&#1099;&#1088;&#1077;&#1079;&#1072;&#1090;&#1100;)<br>
</p>
<img style="width: 500px;" alt="" src="images/fg3.png" align="middle">
<br>
<hr>
<p>4. &#4306;&#4304;&#4307;&#4304;&#4309;&#4312;&#4307;&#4308;&#4311; &#4307;&#4308;&#4321;&#4313;&#4322;&#4317;&#4318;&#4308;,&nbsp; &#4330;&#4304;&#4320;&#4312;&#4308;&#4314; &#4304;&#4307;&#4306;&#4312;&#4314;&#4310;&#4308; &#4315;&#4304;&#4323;&#4321;&#4312;&#4321; &#4315;&#4304;&#4320;&#4335;&#4309;&#4308;&#4316;&#4304; &#4326;&#4312;&#4314;&#4304;&#4313;&#4310;&#4308;
&#4307;&#4304;&#4332;&#4313;&#4304;&#4318;&#4323;&#4316;&#4308;&#4305;&#4312;&#4311; &#4306;&#4304;&#4315;&#4317;&#4322;&#4304;&#4316;&#4312;&#4314; &#4313;&#4317;&#4316;&#4322;&#4308;&#4325;&#4321;&#4322;&#4323;&#4320; &#4315;&#4308;&#4316;&#4312;&#4323;&#4328;&#4312; &#4304;&#4309;&#4312;&#4320;&#4329;&#4312;&#4317;&#4311; Paste (&#1042;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100;).
&#4328;&#4308;&#4307;&#4308;&#4306;&#4304;&#4307; &#4324;&#4304;&#4312;&#4314;&#4312; &#4306;&#4304;&#4307;&#4315;&#4317;&#4322;&#4304;&#4316;&#4312;&#4314;&#4312; &#4312;&#4325;&#4316;&#4308;&#4305;&#4304; &#4307;&#4308;&#4321;&#4322;&#4317;&#4318;&#4310;&#4308;, &#4315;&#4312;&#4311;&#4312;&#4311;&#4308;&#4305;&#4323;&#4314; &#4304;&#4307;&#4306;&#4312;&#4314;&#4310;&#4308;.<br>
</p>
<img style="width: 500px;" alt="" src="images/fg4.png" align="middle">
<br>
<hr>
<p>5. &#4315;&#4317;&#4309;&#4316;&#4312;&#4328;&#4316;&#4317;&#4311; &#4324;&#4304;&#4312;&#4314;&#4312;, &#4315;&#4304;&#4323;&#4321;&#4312;&#4321; &#4315;&#4304;&#4320;&#4335;&#4309;&#4308;&#4316;&#4304; &#4326;&#4312;&#4314;&#4304;&#4313;&#4310;&#4308; &#4307;&#4304;&#4332;&#4313;&#4304;&#4318;&#4323;&#4316;&#4308;&#4305;&#4312;&#4311; &#4306;&#4304;&#4315;&#4317;&#4322;&#4304;&#4316;&#4312;&#4314;
&#4313;&#4317;&#4316;&#4322;&#4308;&#4325;&#4321;&#4322;&#4323;&#4320; &#4315;&#4308;&#4316;&#4312;&#4323;&#4328;&#4312; &#4304;&#4309;&#4312;&#4320;&#4329;&#4312;&#4317;&#4311; &#4318;&#4323;&#4316;&#4325;&#4322;&#4312; Extract here (&#1048;&#1079;&#1074;&#1083;&#1077;&#1095;&#1100; &#1074; &#1090;&#1077;&#1082;&#1091;&#1097;&#1091;&#1102;
&#1087;&#1072;&#1087;&#1082;&#1091;). &#4328;&#4308;&#4307;&#4308;&#4306;&#4304;&#4307; &#4304;&#4320;&#4325;&#4312;&#4309;&#4312; &#4306;&#4304;&#4312;&#4328;&#4314;&#4308;&#4305;&#4304;.<br>
</p>
<img style="width: 500px;" alt="" src="images/fg5.png" align="middle">
<br>
<hr>
<p>6. &#4306;&#4304;&#4328;&#4314;&#4312;&#4314;&#4312; &#4304;&#4320;&#4325;&#4312;&#4309;&#4312;&#4321; &#4324;&#4317;&#4314;&#4307;&#4308;&#4320;&#4321; &#4308;&#4325;&#4316;&#4308;&#4305;&#4304; &#4312;&#4306;&#4312;&#4309;&#4308; &#4321;&#4304;&#4334;&#4308;&#4314;&#4312;, &#4320;&#4304;&#4330; &#4324;&#4304;&#4312;&#4314;&#4321;.<br>
</p>
<img style="width: 500px;" alt="" src="images/fg6.png" align="middle">
<br>
<hr>
<p>7. &#4306;&#4304;&#4309;&#4334;&#4321;&#4316;&#4304;&#4311; &#4324;&#4317;&#4314;&#4307;&#4308;&#4320;&#4312;, &#4315;&#4304;&#4321;&#4328;&#4312; &#4307;&#4304;&#4309;&#4312;&#4316;&#4304;&#4334;&#4304;&#4309;&#4311; &#4311;&#4304;&#4315;&#4304;&#4328;&#4312;&#4321; &#4324;&#4304;&#4312;&#4314;&#4308;&#4305;&#4321;<br>
</p>
<img style="width: 500px;" alt="" src="images/fg7.png" align="middle">
<br>
<hr>
<p>8. &#4309;&#4312;&#4307;&#4320;&#4308; &#4311;&#4304;&#4315;&#4304;&#4328;&#4321; &#4306;&#4304;&#4309;&#4323;&#4328;&#4309;&#4308;&#4305;&#4307;&#4308;&#4311;, &#4307;&#4304;&#4309;&#4320;&#4332;&#4315;&#4323;&#4316;&#4307;&#4308;&#4311; &#4307;&#4304;&#4312;&#4316;&#4321;&#4322;&#4304;&#4314;&#4312;&#4320;&#4308;&#4305;&#4323;&#4314;&#4312; &#4304;&#4320;&#4312;&#4321; &#4311;&#4323; &#4304;&#4320;&#4304;
&#4321;&#4312;&#4321;&#4322;&#4308;&#4315;&#4304;&#4328;&#4312; Python &#4307;&#4304; &#4321;&#4334;&#4309;&#4304; &#4321;&#4304;&#4333;&#4312;&#4320;&#4317; &#4315;&#4317;&#4307;&#4323;&#4314;&#4308;&#4305;&#4312; (&#4311;&#4304;&#4315;&#4304;&#4328;&#4308;&#4305;&#4312;&#4321;&#4304;&#4311;&#4309;&#4312;&#4321; &#4334;&#4328;&#4312;&#4320;&#4304;&#4307; -
&#4315;&#4317;&#4307;&#4323;&#4314;&#4312; Pygame).
&#4328;&#4308;&#4321;&#4304;&#4305;&#4304;&#4315;&#4312;&#4321;&#4312; &#4312;&#4316;&#4321;&#4322;&#4320;&#4323;&#4325;&#4330;&#4312;&#4304; &#4315;&#4317;&#4330;&#4308;&#4315;&#4323;&#4314;&#4312;&#4304; &#4305;&#4315;&#4323;&#4314;&#4310;&#4308;:</p>
<p align="center"><a href="../check_python/check_python.html" target="blank">&#4320;&#4317;&#4306;&#4317;&#4320;
&#4306;&#4304;&#4309;&#4312;&#4306;&#4317;&#4311; &#4304;&#4320;&#4312;&#4321; &#4311;&#4323; &#4304;&#4320;&#4304; &#4321;&#4312;&#4321;&#4322;&#4308;&#4315;&#4304;&#4328;&#4312; &#4307;&#4304;&#4312;&#4316;&#4321;&#4322;&#4304;&#4314;&#4312;&#4320;&#4308;&#4305;&#4323;&#4314;&#4312; Python &#4307;&#4304;/&#4304;&#4316; &#4315;&#4312;&#4321;&#4312;
&#4313;&#4317;&#4315;&#4318;&#4317;&#4316;&#4308;&#4316;&#4322;&#4308;&#4305;&#4312;</a>
</p>
<hr>
<p>9. &#4311;&#4304;&#4315;&#4304;&#4328;&#4312;&#4321; &#4306;&#4304;&#4321;&#4304;&#4328;&#4309;&#4308;&#4305;&#4304;&#4311; &#4317;&#4320;&#4335;&#4308;&#4320; &#4323;&#4316;&#4307;&#4304; &#4307;&#4304;&#4309;&#4304;&#4332;&#4313;&#4304;&#4318;&#4323;&#4316;&#4317;&#4311; &#4311;&#4304;&#4315;&#4304;&#4328;&#4312;&#4321; &#4321;&#4304;&#4334;&#4308;&#4314;&#4312;&#4321; &#4315;&#4325;&#4317;&#4316;&#4308;
&#4324;&#4304;&#4312;&#4314;&#4310;&#4308;. &#4304;&#4315; &#4328;&#4308;&#4315;&#4311;&#4334;&#4309;&#4308;&#4309;&#4304;&#4328;&#4312; &#4320;&#4304;&#4307;&#4306;&#4304;&#4316;&#4304;&#4330; &#4311;&#4304;&#4315;&#4304;&#4328;&#4312;&#4304; Covid Invasion, &#4324;&#4304;&#4312;&#4314;&#4312;&#4321;
&#4321;&#4304;&#4334;&#4308;&#4314;&#4312;&#4330;&#4304;&#4304; covid_invasion.py<br>
</p>
<img style="width: 500px;" alt="" src="images/fg8.png" align="middle">
<br>
<p><br><br>
</p>
</div>
</div>

</body></html>