<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html><head>
  <title>R.Data</title>

  
  
  <link rel="shortcut icon" href="../images/favicon.ico" type="image/x-icon">

  
  <style>
html,body{margin:0;padding:0}
body {background: url(../images/math-behind.jpg); }
body{font:  sylfaen, arial,sans-serif;text-align:center}
p{margin:0 10px 10px}
a{display:block;color: #981793;padding:10px}
div#header h1{height:100px;line-height:80px;margin:0;padding-left:10px;background: #EEE;color: rgb(51, 102, 255)}
div#header {margin:0 auto; background: #EEE; color: rgb(51, 102, 255)}
div#container{text-align:left}
div#content {line-height:2;padding:0px 15px;}
div#content {background: #FFF;color: #000}
div#title h1{margin:100px 0px 0px 0px; padding:20px 0px; background: #FFF;color: rgb(51, 102, 255)}
div#footer{background: #333;color: #FFF}
div#footer p{margin:0;padding:5px 10px}
div#container{width:800px;margin:0 auto}
div#footer{clear:both;width:100%}
  </style>
</head><body>
<div id="header">
<table border="0" cellpadding="2" cellspacing="0" width="100%">
  <tbody>
    <tr>
      <td style="text-align: right;">
      <h1><img style="width: 94px; height: 73px;" alt="R logo" src="../images/Rlogomini.png"></h1>
      </td>
      <td style="text-align: left;">
      <h1>R.Data &#4305;&#4314;&#4317;&#4306;&#4312;</h1>
      </td>
      <td style="text-align: right;">
      <h3><a href="../index.html">&#4321;&#4304;&#4320;&#4329;&#4308;&#4309;&#4310;&#4308; &#4306;&#4304;&#4307;&#4304;&#4321;&#4309;&#4314;&#4304;</a></h3>
      </td>
    </tr>
  </tbody>
</table>
</div>

<div id="container">
<div id="title">
<h1 style="text-align: center;">3.1 &#4312;&#4316;&#4321;&#4322;&#4304;&#4314;&#4304;&#4330;&#4312;&#4304;. &#4318;&#4304;&#4313;&#4308;&#4322;&#4308;&#4305;&#4312; </h1>
</div>
<div id="content"> 


<p class="MsoNormal" style="text-align: justify; line-height: 150%;"><span style="font-size: 12pt; line-height: 150%; font-family: &quot;Sylfaen&quot;,&quot;serif&quot;;" lang="GEO/KAT">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &#4307;&#4320;&#4317;&#4304;
&#4306;&#4304;&#4309;&#4308;&#4330;&#4316;&#4317;&#4311; R-&#4312;&#4321; &#4321;&#4304;&#4332;&#4327;&#4312;&#4321;&#4308;&#4305;&#4321;.<span style="">&nbsp; </span>R - &#4307;&#4304;&#4318;&#4320;&#4317;&#4306;&#4320;&#4304;&#4315;&#4308;&#4305;&#4312;&#4321;
&#4308;&#4316;&#4304;&#4304;, &#4320;&#4317;&#4315;&#4308;&#4314;&#4312;&#4330; &#4306;&#4304;&#4320;&#4313;&#4309;&#4308;&#4323;&#4314;&#4312; &#4321;&#4318;&#4308;&#4330;&#4312;&#4324;&#4312;&#4313;&#4323;&#4320;&#4317;&#4305;&#4312;&#4311; &#4334;&#4304;&#4321;&#4312;&#4304;&#4311;&#4307;&#4308;&#4305;&#4304; - &#4312;&#4321; &#4312;&#4315;&#4304;&#4309;&#4307;&#4320;&#4317;&#4323;&#4314;&#4304;&#4307; &#4321;&#4322;&#4304;&#4322;&#4312;&#4321;&#4322;&#4312;&#4313;&#4323;&#4320;&#4312;
&#4306;&#4304;&#4304;&#4316;&#4306;&#4304;&#4320;&#4312;&#4328;&#4308;&#4305;&#4308;&#4305;&#4312;&#4321;&#4304; &#4307;&#4304; &#4306;&#4320;&#4304;&#4324;&#4312;&#4313;&#4323;&#4314;&#4312; &#4304;&#4316;&#4304;&#4314;&#4312;&#4310;&#4312;&#4321;<span style="">&nbsp; </span>&#4306;&#4304;&#4320;&#4308;&#4315;&#4317;&#4330;&#4304;&#4304;.
<span style="">&nbsp;</span>&#4320;&#4317;&#4306;&#4317;&#4320;&#4330; &#4323;&#4313;&#4309;&#4308; &#4304;&#4309;&#4326;&#4316;&#4312;&#4328;&#4316;&#4308;&#4311; R<span style="">&nbsp; </span>&#4323;&#4321;&#4304;&#4321;&#4327;&#4312;&#4307;&#4314;&#4317;&#4311; &#4309;&#4320;&#4330;&#4308;&#4314;&#4307;&#4308;&#4305;&#4304;.<span style="">&nbsp; </span>&#4315;&#4312;&#4321;&#4312; &#4306;&#4304;&#4307;&#4315;&#4317;&#4332;&#4308;&#4320;&#4304; &#4307;&#4304; &#4307;&#4304;&#4312;&#4316;&#4321;&#4322;&#4304;&#4314;&#4312;&#4320;&#4308;&#4305;&#4304; &#4328;&#4308;&#4321;&#4304;&#4331;&#4314;&#4308;&#4305;&#4308;&#4314;&#4312;&#4304; R-&#4312;&#4321;
&#4321;&#4320;&#4323;&#4314;&#4312; &#4325;&#4321;&#4308;&#4314;&#4323;&#4320;&#4312; &#4304;&#4320;&#4325;&#4312;&#4309;&#4312;&#4307;&#4304;&#4316; (Comprehensive R Archive Network, CRAN), &#4320;&#4317;&#4315;&#4314;&#4312;&#4321; &#4315;&#4312;&#4321;&#4304;&#4315;&#4304;&#4320;&#4311;&#4312;&#4330;&#4304;&#4304;:
<o:p></o:p></span></p>


<p class="MsoNormal" style="text-align: justify; line-height: 150%;"><a href="http://cran.r-project.org/"><span style="font-size: 12pt; line-height: 150%; font-family: &quot;Sylfaen&quot;,&quot;serif&quot;;" lang="GEO/KAT">http://cran.r-project.org</span></a><span style="font-size: 12pt; line-height: 150%; font-family: &quot;Sylfaen&quot;,&quot;serif&quot;;" lang="GEO/KAT"><o:p></o:p></span></p>


<p class="MsoNormal" style="text-align: justify; line-height: 150%;"><span style="font-size: 12pt; line-height: 150%; font-family: &quot;Sylfaen&quot;,&quot;serif&quot;;" lang="GEO/KAT">&#4317;&#4318;&#4308;&#4320;&#4304;&#4330;&#4312;&#4323;&#4314;&#4312;
&#4321;&#4312;&#4321;&#4322;&#4308;&#4315;&#4312;&#4321; &#4315;&#4312;&#4334;&#4308;&#4307;&#4309;&#4312;&#4311; &#4306;&#4304;&#4307;&#4304;&#4309;&#4312;&#4307;&#4308;&#4311; &#4321;&#4304;&#4312;&#4316;&#4321;&#4304;&#4322;&#4304;&#4314;&#4304;&#4330;&#4312;&#4317; &#4318;&#4304;&#4313;&#4308;&#4322;&#4308;&#4305;&#4312;&#4321; &#4306;&#4309;&#4308;&#4320;&#4307;&#4310;&#4308; &#4307;&#4304; &#4304;&#4309;&#4312;&#4320;&#4329;&#4312;&#4317;&#4311;: install
R for the first time.<span style="">&nbsp; </span>&#4312;&#4325;&#4309;&#4308;&#4304; &#4315;&#4317;&#4330;&#4308;&#4315;&#4323;&#4314;&#4312; &#4312;&#4316;&#4321;&#4322;&#4320;&#4323;&#4325;&#4330;&#4312;&#4304;
&#4311;&#4323; &#4320;&#4317;&#4306;&#4317;&#4320; &#4323;&#4316;&#4307;&#4304; &#4307;&#4304;&#4309;&#4304;&#4312;&#4316;&#4321;&#4322;&#4304;&#4314;&#4312;&#4320;&#4317;&#4311; &#4312;&#4321;, &#4321;&#4334;&#4309;&#4304;&#4307;&#4304;&#4321;&#4334;&#4309;&#4304; &#4317;&#4318;&#4308;&#4320;&#4304;&#4330;&#4312;&#4323;&#4314;&#4312; &#4321;&#4312;&#4321;&#4322;&#4308;&#4315;&#4308;&#4305;&#4312;&#4321;&#4304;&#4311;&#4309;&#4312;&#4321;. R-&#4312;&#4321; &#4324;&#4323;&#4316;&#4325;&#4330;&#4312;&#4317;&#4316;&#4304;&#4314;&#4312;
&#4304;&#4320; &#4306;&#4304;&#4316;&#4321;&#4334;&#4309;&#4308;&#4309;&#4307;&#4308;&#4305;&#4304; &#4317;&#4318;&#4308;&#4320;&#4304;&#4330;&#4312;&#4323;&#4314;&#4312; &#4321;&#4312;&#4321;&#4322;&#4308;&#4315;&#4308;&#4305;&#4312;&#4321; &#4315;&#4312;&#4334;&#4308;&#4307;&#4309;&#4312;&#4311;. &#4317;&#4318;&#4308;&#4320;&#4304;&#4330;&#4312;&#4323;&#4314;&#4312; &#4321;&#4312;&#4321;&#4322;&#4308;&#4315;&#4312;&#4321;&#4304;&#4311;&#4309;&#4312;&#4321; &#4307;&#4304;&#4315;&#4304;&#4334;&#4304;&#4321;&#4312;&#4304;&#4311;&#4308;&#4305;&#4308;&#4314;&#4312;
&#4311;&#4304;&#4309;&#4312;&#4321;&#4308;&#4305;&#4323;&#4320;&#4308;&#4305;&#4308;&#4305;&#4312;, &#4315;&#4330;&#4312;&#4320;&#4308;&#4307;&#4312; &#4321;&#4334;&#4309;&#4304;&#4317;&#4305;&#4308;&#4305;&#4312;&#4311;, &#4309;&#4314;&#4312;&#4316;&#4307;&#4308;&#4305;&#4304; &#4312;&#4316;&#4322;&#4308;&#4320;&#4324;&#4308;&#4312;&#4321;&#4311;&#4304;&#4316; &#4307;&#4304; &#4317;&#4318;&#4308;&#4320;&#4304;&#4330;&#4312;&#4323;&#4314; &#4321;&#4312;&#4321;&#4322;&#4308;&#4315;&#4304;&#4321;&#4311;&#4304;&#4316;
&#4315;&#4323;&#4328;&#4304;&#4317;&#4305;&#4304;&#4321;&#4304;&#4321; &#4307;&#4304;&#4313;&#4304;&#4309;&#4328;&#4312;&#4320;&#4308;&#4305;&#4323;&#4314; &#4321;&#4304;&#4313;&#4312;&#4311;&#4334;&#4308;&#4305;&#4328;&#4312;. &#4328;&#4308;&#4315;&#4307;&#4306;&#4317;&#4315;&#4328;&#4312; &#4329;&#4309;&#4308;&#4316; &#4321;&#4304;&#4323;&#4305;&#4304;&#4320;&#4312; &#4306;&#4309;&#4308;&#4325;&#4316;&#4308;&#4305;&#4304; Windows &#4317;&#4318;&#4308;&#4320;&#4304;&#4330;&#4312;&#4323;&#4314;&#4312;
&#4321;&#4312;&#4321;&#4322;&#4308;&#4315;&#4312;&#4321;&#4304;&#4311;&#4309;&#4312;&#4321; &#4315;&#4317;&#4327;&#4309;&#4304;&#4316;&#4312;&#4314; <span style="">&nbsp;</span>&#4315;&#4304;&#4306;&#4304;&#4314;&#4311;&#4308;&#4305;&#4310;&#4308;, &#4311;&#4323;&#4315;&#4330;&#4304;
&#4321;&#4334;&#4309;&#4304; &#4317;&#4318;&#4308;&#4320;&#4304;&#4330;&#4312;&#4323;&#4314;&#4312; &#4321;&#4312;&#4321;&#4322;&#4308;&#4315;&#4308;&#4305;&#4312;&#4321;&#4304;&#4311;&#4309;&#4312;&#4321; &#4321;&#4318;&#4308;&#4330;&#4312;&#4324;&#4312;&#4313;&#4323;&#4320; &#4321;&#4304;&#4313;&#4312;&#4311;&#4334;&#4308;&#4305;&#4310;&#4308; &#4312;&#4316;&#4324;&#4317;&#4320;&#4315;&#4304;&#4330;&#4312;&#4304; &#4315;&#4317;&#4312;&#4331;&#4312;&#4308;&#4305;&#4304; &#4304;&#4315; &#4318;&#4320;&#4317;&#4306;&#4320;&#4304;&#4315;&#4308;&#4305;&#4312;&#4321;
&#4321;&#4304;&#4312;&#4322;&#4308;&#4305;&#4310;&#4308;. &#4312;&#4316;&#4321;&#4322;&#4304;&#4314;&#4304;&#4330;&#4312;&#4312;&#4321; &#4328;&#4308;&#4315;&#4307;&#4306;&#4317;&#4315; &#4328;&#4308;&#4306;&#4309;&#4312;&#4331;&#4314;&#4312;&#4304; &#4306;&#4304;&#4309;&#4323;&#4328;&#4309;&#4304;&#4311; R-&#4312;&#4321; &#4306;&#4320;&#4304;&#4324;&#4312;&#4313;&#4323;&#4314;&#4312; &#4312;&#4316;&#4322;&#4308;&#4320;&#4324;&#4308;&#4312;&#4321;&#4312; &#4307;&#4304; &#4306;&#4304;&#4316;&#4309;&#4304;&#4306;&#4320;&#4331;&#4317;&#4311;
&#4315;&#4323;&#4328;&#4304;&#4317;&#4305;&#4304; &#4315;&#4304;&#4321;&#4328;&#4312;. <span style="">&nbsp;</span>&#4311;&#4323;&#4315;&#4330;&#4304; &#4323;&#4315;&#4335;&#4317;&#4305;&#4308;&#4321;&#4312;&#4304; &#4328;&#4308;&#4315;&#4307;&#4306;&#4317;&#4315;&#4312; &#4315;&#4323;&#4328;&#4304;&#4317;&#4305;&#4312;&#4321;
&#4306;&#4304;&#4315;&#4304;&#4320;&#4322;&#4312;&#4309;&#4308;&#4305;&#4312;&#4321;&#4304;&#4311;&#4309;&#4312;&#4321; &#4306;&#4304;&#4307;&#4315;&#4317;&#4309;&#4332;&#4308;&#4320;&#4317;&#4311; &#4307;&#4304; &#4307;&#4304;&#4309;&#4304;&#4312;&#4316;&#4321;&#4322;&#4304;&#4314;&#4312;&#4320;&#4317;&#4311; <span style="">&nbsp;</span>R-&#4312;&#4321; &#4308;. &#4332;. &#4306;&#4304;&#4320;&#4321;&#4323;&#4314;&#4312; &#4318;&#4320;&#4317;&#4306;&#4320;&#4304;&#4315;&#4304; - &#4307;&#4304;&#4315;&#4323;&#4328;&#4304;&#4309;&#4308;&#4305;&#4312;&#4321; &#4312;&#4316;&#4322;&#4308;&#4306;&#4320;&#4312;&#4320;&#4308;&#4305;&#4323;&#4314;&#4312;
&#4306;&#4304;&#4320;&#4308;&#4315;&#4317; (Integrated Development Environment -IDE) Rstudio, &#4320;&#4317;&#4315;&#4308;&#4314;&#4312;&#4330; &#4304;&#4321;&#4308;&#4309;&#4308; &#4323;&#4324;&#4304;&#4321;&#4317; &#4314;&#4312;&#4330;&#4308;&#4316;&#4310;&#4312;&#4312;&#4311;
&#4309;&#4320;&#4330;&#4308;&#4314;&#4307;&#4308;&#4305;&#4304; &#4307;&#4304; &#4334;&#4308;&#4314;&#4315;&#4312;&#4321;&#4304;&#4332;&#4309;&#4307;&#4317;&#4315;&#4312;&#4304; &#4328;&#4308;&#4315;&#4307;&#4308;&#4306; &#4315;&#4312;&#4321;&#4304;&#4315;&#4304;&#4320;&#4311;&#4310;&#4308;:<o:p></o:p></span></p>


<p class="MsoNormal" style="text-align: justify; line-height: 150%;"><a href="http://www.rstudio.com/ide/"><span style="font-size: 12pt; line-height: 150%; font-family: &quot;Sylfaen&quot;,&quot;serif&quot;;" lang="GEO/KAT">http://www.rstudio.com/ide/</span></a><span style="font-size: 12pt; line-height: 150%; font-family: &quot;Sylfaen&quot;,&quot;serif&quot;;" lang="GEO/KAT"><o:p></o:p></span></p>


<p class="MsoNormal" style="text-align: justify; line-height: 150%;"><span style="font-size: 12pt; line-height: 150%; font-family: &quot;Sylfaen&quot;,&quot;serif&quot;;" lang="GEO/KAT">&#4304;&#4309;&#4312;&#4320;&#4329;&#4312;&#4317;&#4311;
&#4326;&#4312;&#4314;&#4304;&#4313;&#4312; Download Rstudio Desktop. &#4320;&#4317;&#4307;&#4308;&#4321;&#4304;&#4330; &#4317;&#4320;&#4312;&#4309;&#4308; &#4318;&#4320;&#4317;&#4306;&#4320;&#4304;&#4315;&#4304; &#4307;&#4304;&#4312;&#4316;&#4321;&#4322;&#4304;&#4314;&#4312;&#4320;&#4308;&#4305;&#4323;&#4314;&#4312;&#4304; &#4307;&#4304;&#4309;&#4312;&#4332;&#4327;&#4317;&#4311;
&#4318;&#4312;&#4320;&#4309;&#4308;&#4314;&#4312; &#4306;&#4304;&#4330;&#4316;&#4317;&#4305;&#4304; R-&#4311;&#4304;&#4316;. &#4306;&#4304;&#4309;&#4323;&#4328;&#4309;&#4304;&#4311; Rstudio - &#4315;&#4317;&#4315;&#4304;&#4309;&#4304;&#4314;&#4328;&#4312; R-&#4311;&#4304;&#4316; &#4315;&#4323;&#4328;&#4304;&#4317;&#4305;&#4312;&#4321; &#4327;&#4317;&#4309;&#4308;&#4314; &#4321;&#4308;&#4321;&#4312;&#4304;&#4321;
&#4304;&#4315; &#4318;&#4320;&#4317;&#4306;&#4320;&#4304;&#4315;&#4312;&#4321; &#4315;&#4308;&#4328;&#4309;&#4308;&#4317;&#4305;&#4312;&#4311; &#4309;&#4304;&#4332;&#4304;&#4320;&#4315;&#4317;&#4308;&#4305;&#4311;. &#4306;&#4304;&#4316;&#4309;&#4312;&#4334;&#4312;&#4314;&#4317;&#4311; &#4318;&#4320;&#4317;&#4306;&#4320;&#4304;&#4315;&#4312;&#4321; &#4315;&#4312;&#4308;&#4320;<span style="">&nbsp; </span>&#4306;&#4304;&#4315;&#4317;&#4322;&#4304;&#4316;&#4312;&#4314;&#4312; &#4308;&#4313;&#4320;&#4304;&#4316;&#4312;.<o:p></o:p></span></p>


<div style="text-align: center;"><span style="font-size: 12pt; line-height: 150%; font-family: &quot;Sylfaen&quot;,&quot;serif&quot;;"><!--[if gte vml 1]><v:shapetype
 id="_x0000_t75" coordsize="21600,21600" o:spt="75" o:preferrelative="t"
 path="m@4@5l@4@11@9@11@9@5xe" filled="f" stroked="f">
 <v:stroke joinstyle="miter"/>
 <v:formulas>
  <v:f eqn="if lineDrawn pixelLineWidth 0"/>
  <v:f eqn="sum @0 1 0"/>
  <v:f eqn="sum 0 0 @1"/>
  <v:f eqn="prod @2 1 2"/>
  <v:f eqn="prod @3 21600 pixelWidth"/>
  <v:f eqn="prod @3 21600 pixelHeight"/>
  <v:f eqn="sum @0 0 1"/>
  <v:f eqn="prod @6 1 2"/>
  <v:f eqn="prod @7 21600 pixelWidth"/>
  <v:f eqn="sum @8 21600 0"/>
  <v:f eqn="prod @7 21600 pixelHeight"/>
  <v:f eqn="sum @10 21600 0"/>
 </v:formulas>
 <v:path o:extrusionok="f" gradientshapeok="t" o:connecttype="rect"/>
 <o:lock v:ext="edit" aspectratio="t"/>
</v:shapetype><v:shape id="&#1056;&#1080;&#1089;&#1091;&#1085;&#1086;&#1082;_x0020_0" o:spid="_x0000_i1025" type="#_x0000_t75"
 alt="3-1-1.png" style='width:468pt;height:249pt;visibility:visible;
 mso-wrap-style:square'>
 <v:imagedata src="file:///C:\Users\Gocha\AppData\Local\Temp\msohtmlclip1\01\clip_image001.png"
  o:title="3-1-1"/>
</v:shape><![endif]--><!--[if !vml]--><img style="width: 680px; height: 362px;" alt="" src="../images/3-1-1.png"></span><br>
<span style="font-size: 12pt; line-height: 150%; font-family: &quot;Sylfaen&quot;,&quot;serif&quot;;"></span></div>
<p class="MsoNormal" style="text-align: justify; line-height: 150%;"><span style="font-size: 12pt; line-height: 150%; font-family: &quot;Sylfaen&quot;,&quot;serif&quot;;"><!--[endif]--></span><span style="font-size: 12pt; line-height: 150%; font-family: &quot;Sylfaen&quot;,&quot;serif&quot;;" lang="GEO/KAT"><o:p></o:p></span></p>


<p class="MsoNormal" style="text-align: justify; line-height: 150%;"><span style="font-size: 12pt; line-height: 150%; font-family: &quot;Sylfaen&quot;,&quot;serif&quot;;" lang="GEO/KAT"><span style="">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </span>&#4318;&#4320;&#4317;&#4306;&#4320;&#4304;&#4315;&#4304;&#4321;<span style="">&nbsp;&nbsp; </span>&#4312;&#4316;&#4322;&#4323;&#4312;&#4330;&#4312;&#4323;&#4320;&#4312; &#4312;&#4316;&#4322;&#4308;&#4320;&#4324;&#4308;&#4312;&#4321;&#4312; &#4304;&#4325;&#4309;&#4321;. &#4312;&#4321; &#4317;&#4311;&#4334; &#4304;&#4320;&#4308;&#4307; &#4304;&#4320;&#4312;&#4321;
&#4307;&#4304;&#4327;&#4317;&#4324;&#4312;&#4314;&#4312;, &#4311;&#4304;&#4309;&#4310;&#4308; &#4318;&#4320;&#4317;&#4306;&#4320;&#4304;&#4315;&#4304;&#4321; &#4304;&#4325;&#4309;&#4321; &#4315;&#4308;&#4316;&#4312;&#4323;&#4321; &#4310;&#4317;&#4314;&#4312;, &#4320;&#4317;&#4315;&#4314;&#4312;&#4321; &#4310;&#4317;&#4306;&#4312;&#4308;&#4320;&#4311;&#4312; &#4334;&#4328;&#4312;&#4320;&#4304;&#4307; &#4315;&#4317;&#4334;&#4315;&#4304;&#4320;&#4308;&#4305;&#4304;&#4307;&#4312; &#4318;&#4323;&#4316;&#4325;&#4322;&#4312;
&#4307;&#4323;&#4305;&#4314;&#4312;&#4320;&#4308;&#4305;&#4323;&#4314;&#4312;&#4304; &#4318;&#4312;&#4325;&#4322;&#4317;&#4306;&#4320;&#4304;&#4315;&#4312;&#4321; &#4321;&#4304;&#4334;&#4312;&#4311; &#4315;&#4312;&#4321; &#4325;&#4309;&#4308;&#4315;&#4317;&#4311;. &#4318;&#4312;&#4320;&#4309;&#4308;&#4314;&#4312; &#4304;&#4320;&#4308; &#4315;&#4317;&#4312;&#4330;&#4304;&#4309;&#4321; &#4318;&#4320;&#4317;&#4306;&#4320;&#4304;&#4315;&#4312;&#4321; (&#4321;&#4313;&#4320;&#4312;&#4318;&#4322;&#4312;&#4321;)
&#4322;&#4308;&#4325;&#4321;&#4322;&#4321;, &#4304;&#4325; &#4309;&#4304;&#4334;&#4307;&#4308;&#4316;&#4311; &#4315;&#4312;&#4321; &#4304;&#4313;&#4320;&#4308;&#4305;&#4304;&#4321;, &#4320;&#4308;&#4307;&#4304;&#4325;&#4322;&#4312;&#4320;&#4308;&#4305;&#4304;&#4321;, &#4328;&#4308;&#4316;&#4304;&#4334;&#4309;&#4304;&#4321; &#4307;&#4304; &#4328;&#4308;&#4321;&#4320;&#4323;&#4314;&#4308;&#4305;&#4312;&#4321;&#4304;&#4311;&#4309;&#4312;&#4321; &#4305;&#4320;&#4331;&#4304;&#4316;&#4308;&#4305;&#4312;&#4321;
&#4315;&#4312;&#4330;&#4308;&#4315;&#4304;&#4321;. &#4304;&#4334;&#4304;&#4314;&#4312; &#4321;&#4313;&#4320;&#4312;&#4318;&#4322;&#4312;&#4321; &#4307;&#4304;&#4321;&#4304;&#4332;&#4327;&#4308;&#4305;&#4304;&#4307; &#4309;&#4334;&#4321;&#4316;&#4312;&#4311; &#4304;&#4334;&#4304;&#4314; &#4306;&#4309;&#4308;&#4320;&#4307;&#4321; &#4315;&#4308;&#4316;&#4312;&#4323;&#4321; &#4315;&#4308;&#4328;&#4309;&#4308;&#4317;&#4305;&#4312;&#4311;: File -
New File - R Script. <span style="">&nbsp;</span>&#4318;&#4320;&#4317;&#4306;&#4320;&#4304;&#4315;&#4312;&#4321; &#4311;&#4312;&#4311;&#4317;&#4308;&#4323;&#4314;&#4312; &#4321;&#4322;&#4320;&#4312;&#4325;&#4317;&#4316;&#4312;
&#4312;&#4316;&#4317;&#4315;&#4320;&#4308;&#4305;&#4304; &#4304;&#4309;&#4322;&#4317;&#4315;&#4304;&#4322;&#4323;&#4320;&#4304;&#4307;, &#4320;&#4304;&#4330; &#4315;&#4312;&#4321; &#4306;&#4304;&#4315;&#4304;&#4320;&#4311;&#4309;&#4304;&#4321;, &#4328;&#4308;&#4330;&#4307;&#4317;&#4315;&#4308;&#4305;&#4312;&#4321; &#4331;&#4312;&#4308;&#4305;&#4304;&#4321; &#4306;&#4309;&#4312;&#4304;&#4307;&#4309;&#4312;&#4314;&#4308;&#4305;&#4321;. <span style="">&nbsp;&nbsp;</span>&#4315;&#4308;&#4317;&#4320;&#4308; &#4304;&#4320;&#4308; - &#4313;&#4317;&#4316;&#4321;&#4317;&#4314;&#4312;&#4321; &#4304;&#4320;&#4308;&#4304;. R-&#4312;&#4321; &#4313;&#4317;&#4316;&#4321;&#4317;&#4314;&#4312; (<b style="">Console</b>) &#4305;&#4320;&#4331;&#4304;&#4316;&#4308;&#4305;&#4308;&#4305;&#4312;&#4321; &#4307;&#4304;&#4323;&#4327;&#4317;&#4316;&#4308;&#4305;&#4314;&#4312;&#4309; &#4328;&#4308;&#4321;&#4304;&#4321;&#4320;&#4323;&#4314;&#4308;&#4305;&#4314;&#4304;&#4307;
&#4306;&#4304;&#4315;&#4317;&#4312;&#4327;&#4308;&#4316;&#4308;&#4305;&#4304;. &#4305;&#4320;&#4331;&#4304;&#4316;&#4308;&#4305;&#4304; &#4304;&#4312;&#4313;&#4320;&#4312;&#4305;&#4308;&#4305;&#4304; &#4313;&#4317;&#4316;&#4321;&#4317;&#4314;&#4312;&#4321; &#4315;&#4317;&#4332;&#4309;&#4308;&#4309;&#4312;&#4321; &#4313;&#4323;&#4320;&#4321;&#4317;&#4320;&#4311;&#4304;&#4316;:<span style="">&nbsp; </span>&gt; | &#4307;&#4304; &#4321;&#4320;&#4323;&#4314;&#4307;&#4308;&#4305;&#4304; Enter &#4313;&#4314;&#4304;&#4309;&#4312;&#4328;&#4312;&#4311;. &#4308;&#4321; &#4304;&#4325;&#4322;&#4323;&#4304;&#4314;&#4323;&#4320;&#4312;&#4304;
&#4315;&#4312;&#4321;&#4312; &#4313;&#4304;&#4314;&#4313;&#4323;&#4314;&#4304;&#4322;&#4317;&#4320;&#4312;&#4321; &#4320;&#4308;&#4319;&#4312;&#4315;&#4328;&#4312; &#4306;&#4304;&#4315;&#4317;&#4327;&#4308;&#4316;&#4308;&#4305;&#4312;&#4321;, &#4307;&#4304;&#4334;&#4315;&#4304;&#4320;&#4308;&#4305;&#4312;&#4321; &#4315;&#4317;&#4331;&#4312;&#4308;&#4305;&#4312;&#4321;, &#4320;&#4304;&#4312;&#4315;&#4308; &#4321;&#4304;&#4321;&#4332;&#4320;&#4304;&#4324;&#4317; &#4305;&#4320;&#4331;&#4304;&#4316;&#4308;&#4305;&#4312;&#4321;
&#4318;&#4320;&#4317;&#4306;&#4320;&#4304;&#4315;&#4312;&#4321; &#4322;&#4308;&#4325;&#4321;&#4322;&#4312;&#4321; &#4315;&#4312;&#4326;&#4315;&#4304; &#4328;&#4308;&#4321;&#4304;&#4321;&#4320;&#4323;&#4314;&#4308;&#4305;&#4314;&#4304;&#4307; &#4307;&#4304; &#4321;&#4334;&#4309;&#4304; &#4328;&#4308;&#4315;&#4311;&#4334;&#4309;&#4308;&#4309;&#4308;&#4305;&#4328;&#4312;. &#4318;&#4320;&#4317;&#4306;&#4320;&#4304;&#4315;&#4312;&#4321; &#4309;&#4308;&#4314;&#4312;&#4321;&#4304;&#4306;&#4304;&#4316;
&#4306;&#4304;&#4316;&#4321;&#4334;&#4309;&#4304;&#4309;&#4308;&#4305;&#4312;&#4311; &#4304;&#4325; &#4305;&#4320;&#4331;&#4304;&#4316;&#4308;&#4305;&#4308;&#4305;&#4312; &#4328;&#4308;&#4312;&#4327;&#4309;&#4304;&#4316;&#4308;&#4305;&#4304; &#4307;&#4304; &#4321;&#4320;&#4323;&#4314;&#4307;&#4308;&#4305;&#4304; &#4330;&#4304;&#4314;-&#4330;&#4304;&#4314;&#4313;&#4308;. &#4304;&#4315;&#4304;&#4309;&#4308; &#4313;&#4317;&#4316;&#4321;&#4317;&#4314;&#4328;&#4312; &#4304;&#4312;&#4321;&#4304;&#4334;&#4308;&#4305;&#4304;
&#4318;&#4320;&#4317;&#4306;&#4320;&#4304;&#4315;&#4312;&#4321; &#4328;&#4308;&#4321;&#4320;&#4323;&#4314;&#4308;&#4305;&#4312;&#4321;, &#4306;&#4304;&#4304;&#4316;&#4306;&#4304;&#4320;&#4312;&#4328;&#4308;&#4305;&#4308;&#4305;&#4312;&#4321;<span style="">&nbsp; </span>&#4328;&#4308;&#4307;&#4308;&#4306;&#4308;&#4305;&#4312;
(&#4306;&#4304;&#4320;&#4307;&#4304; &#4306;&#4320;&#4304;&#4324;&#4312;&#4313;&#4323;&#4314;&#4312; &#4306;&#4304;&#4315;&#4317;&#4321;&#4304;&#4334;&#4323;&#4314;&#4308;&#4305;&#4308;&#4305;&#4312;&#4321;&#4304;). &#4313;&#4317;&#4316;&#4321;&#4317;&#4314;&#4312;&#4321; &#4304;&#4320;&#4308;, &#4315;&#4312;&#4321; &#4311;&#4304;&#4309;&#4310;&#4308; &#4315;&#4317;&#4311;&#4304;&#4309;&#4321;&#4308;&#4305;&#4323;&#4314; &#4329;&#4304;&#4316;&#4304;&#4320;&#4311;&#4310;&#4308;
&#4307;&#4304;&#4332;&#4313;&#4304;&#4318;&#4323;&#4316;&#4308;&#4305;&#4312;&#4311;, &#4328;&#4308;&#4306;&#4309;&#4312;&#4331;&#4314;&#4312;&#4304; &#4306;&#4304;&#4307;&#4304;&#4309;&#4320;&#4311;&#4317;&#4311; &#4322;&#4308;&#4320;&#4315;&#4312;&#4316;&#4304;&#4314;&#4312;&#4321; &#4320;&#4308;&#4319;&#4312;&#4315;&#4328;&#4312; (<b style="">Terminal</b>). &#4322;&#4308;&#4320;&#4315;&#4312;&#4316;&#4304;&#4314;&#4312; &#4334;&#4321;&#4316;&#4312;&#4321; &#4317;&#4318;&#4308;&#4320;&#4304;&#4330;&#4312;&#4323;&#4314; &#4321;&#4312;&#4321;&#4322;&#4308;&#4315;&#4304;&#4321;&#4311;&#4304;&#4316; &#4321;&#4304;&#4315;&#4323;&#4328;&#4304;&#4317; &#4321;&#4308;&#4321;&#4312;&#4304;&#4321;. &#4304;&#4315;&#4307;&#4308;&#4316;&#4304;&#4307;,
&#4318;&#4320;&#4317;&#4306;&#4320;&#4304;&#4315;&#4312;&#4307;&#4304;&#4316; &#4306;&#4304;&#4315;&#4317;&#4323;&#4321;&#4309;&#4314;&#4308;&#4314;&#4304;&#4307; &#4328;&#4308;&#4306;&#4309;&#4312;&#4331;&#4314;&#4312;&#4304; &#4306;&#4304;&#4316;&#4309;&#4304;&#4334;&#4317;&#4320;&#4330;&#4312;&#4308;&#4314;&#4317;&#4311; &#4312;&#4321; &#4317;&#4318;&#4308;&#4320;&#4304;&#4330;&#4312;&#4308;&#4305;&#4312;, &#4320;&#4317;&#4315;&#4314;&#4308;&#4305;&#4312;&#4330; &#4317;&#4318;&#4308;&#4320;&#4304;&#4330;&#4312;&#4323;&#4314;
&#4321;&#4312;&#4321;&#4322;&#4308;&#4315;&#4304;&#4321;&#4311;&#4304;&#4316; &#4321;&#4304;&#4315;&#4323;&#4328;&#4304;&#4317;&#4307; &#4307;&#4304;&#4306;&#4309;&#4333;&#4312;&#4320;&#4307;&#4308;&#4305;&#4304;. &#4317;&#4318;&#4308;&#4320;&#4304;&#4330;&#4312;&#4323;&#4314; &#4321;&#4312;&#4321;&#4322;&#4308;&#4315;&#4304;&#4321;&#4311;&#4304;&#4316; &#4315;&#4323;&#4328;&#4304;&#4317;&#4305;&#4312;&#4321; &#4306;&#4304;&#4320;&#4313;&#4309;&#4308;&#4323;&#4314; &#4324;&#4323;&#4316;&#4325;&#4330;&#4312;&#4317;&#4316;&#4304;&#4314;&#4321;
(&#4324;&#4304;&#4312;&#4314;&#4308;&#4305;&#4311;&#4304;&#4316;, &#4324;&#4317;&#4314;&#4307;&#4308;&#4320;&#4308;&#4305;&#4311;&#4304;&#4316; &#4315;&#4323;&#4328;&#4304;&#4317;&#4305;&#4304; &#4307;&#4304; &#4321;&#4334;&#4309;&#4304;) R-&#4312;&#4321; &#4328;&#4312;&#4307;&#4304;<span style="">&nbsp; </span>&#4324;&#4323;&#4316;&#4325;&#4330;&#4312;&#4308;&#4305;&#4312;&#4330; &#4306;&#4309;&#4304;&#4331;&#4314;&#4308;&#4309;&#4321;. &#4315;&#4308;&#4321;&#4304;&#4315;&#4308; &#4304;&#4320;&#4308; &#4320;&#4304;&#4315;&#4317;&#4307;&#4308;&#4316;&#4312;&#4315;&#4308; &#4329;&#4304;&#4316;&#4304;&#4320;&#4311;&#4321;
&#4328;&#4308;&#4312;&#4330;&#4304;&#4309;&#4321;. &#4318;&#4320;&#4304;&#4325;&#4322;&#4312;&#4313;&#4323;&#4314;&#4304;&#4307; &#4334;&#4328;&#4312;&#4320;&#4304;&#4307; &#4306;&#4304;&#4315;&#4317;&#4327;&#4308;&#4316;&#4308;&#4305;&#4304;&#4307;&#4312;&#4304; &#4329;&#4304;&#4316;&#4304;&#4320;&#4311;&#4312; <b style="">Environment</b>, &#4321;&#4304;&#4307;&#4304;&#4330; &#4332;&#4304;&#4320;&#4315;&#4317;&#4307;&#4306;&#4308;&#4316;&#4312;&#4314;&#4312;&#4304; &#4318;&#4320;&#4317;&#4306;&#4320;&#4304;&#4315;&#4312;&#4321; &#4328;&#4308;&#4321;&#4320;&#4323;&#4314;&#4308;&#4305;&#4312;&#4321; &#4328;&#4308;&#4307;&#4308;&#4306;&#4304;&#4307; &#4328;&#4308;&#4325;&#4315;&#4316;&#4312;&#4314;&#4312;
&#4330;&#4309;&#4314;&#4304;&#4307;&#4308;&#4305;&#4312; (&#4315;&#4304;&#4311; &#4328;&#4317;&#4320;&#4312;&#4321; &#4315;&#4317;&#4316;&#4304;&#4330;&#4308;&#4315;&#4311;&#4304; &#4330;&#4334;&#4320;&#4312;&#4314;&#4308;&#4305;&#4312;&#4330;), &#4315;&#4304;&#4311;&#4311;&#4304;&#4316; &#4307;&#4304;&#4313;&#4304;&#4309;&#4328;&#4312;&#4320;&#4308;&#4305;&#4323;&#4314;&#4312;, &#4306;&#4304;&#4304;&#4316;&#4306;&#4304;&#4320;&#4312;&#4328;&#4308;&#4305;&#4323;&#4314;&#4312; &#4315;&#4316;&#4312;&#4328;&#4309;&#4316;&#4308;&#4314;&#4317;&#4305;&#4308;&#4305;&#4312;,
&#4318;&#4320;&#4317;&#4306;&#4320;&#4304;&#4315;&#4304;&#4328;&#4312; &#4306;&#4304;&#4316;&#4321;&#4304;&#4310;&#4326;&#4309;&#4320;&#4323;&#4314;&#4312; &#4307;&#4304; &#4328;&#4308;&#4321;&#4320;&#4323;&#4314;&#4308;&#4305;&#4323;&#4314;&#4312; &#4324;&#4323;&#4316;&#4325;&#4330;&#4312;&#4308;&#4305;&#4312;. &#4304;&#4315; &#4329;&#4304;&#4316;&#4304;&#4320;&#4311;&#4312;&#4321; &#4307;&#4304;&#4334;&#4315;&#4304;&#4320;&#4308;&#4305;&#4312;&#4311; &#4331;&#4304;&#4314;&#4310;&#4308; &#4315;&#4317;&#4321;&#4304;&#4334;&#4308;&#4320;&#4334;&#4308;&#4305;&#4308;&#4314;&#4312;&#4304;
&#4318;&#4320;&#4317;&#4306;&#4320;&#4304;&#4315;&#4312;&#4321; &#4328;&#4308;&#4321;&#4320;&#4323;&#4314;&#4308;&#4305;&#4312;&#4321; &#4304;&#4316; &#4306;&#4304;&#4315;&#4304;&#4320;&#4311;&#4309;&#4312;&#4321;(&#4328;&#4308;&#4330;&#4307;&#4317;&#4315;&#4308;&#4305;&#4312;&#4321; &#4331;&#4312;&#4308;&#4305;&#4312;&#4321;)<span style="">&nbsp; </span>&#4315;&#4317;&#4315;&#4308;&#4316;&#4322;&#4328;&#4312; &#4330;&#4309;&#4314;&#4304;&#4307;&#4308;&#4305;&#4312;&#4321; &#4328;&#4323;&#4304;&#4314;&#4308;&#4307;&#4323;&#4320;&#4312; &#4313;&#4317;&#4316;&#4322;&#4320;&#4317;&#4314;&#4312;, &#4304;&#4321;&#4308;&#4309;&#4308; &#4328;&#4308;&#4312;&#4331;&#4314;&#4308;&#4305;&#4304;
&#4310;&#4317;&#4306; &#4330;&#4309;&#4314;&#4304;&#4307;&#4310;&#4308; &#4307;&#4304;&#4332;&#4313;&#4304;&#4318;&#4323;&#4316;&#4308;&#4305;&#4312;&#4311; &#4315;&#4312;&#4321;&#4312; &#4321;&#4322;&#4320;&#4323;&#4325;&#4322;&#4323;&#4320;&#4312;&#4321; &#4304;&#4325;&#4309;&#4308; &#4307;&#4304;&#4311;&#4309;&#4304;&#4314;&#4312;&#4308;&#4320;&#4308;&#4305;&#4304; &#4304;&#4316; &#4315;&#4304;&#4311;&#4312; &#4304;&#4325;&#4322;&#4323;&#4304;&#4314;&#4323;&#4320;&#4312;, &#4315;&#4312;&#4315;&#4307;&#4312;&#4316;&#4304;&#4320;&#4308;
&#4328;&#4312;&#4306;&#4304;&#4311;&#4304;&#4309;&#4321;&#4312;&#4321;, &#4328;&#4308;&#4315;&#4330;&#4309;&#4308;&#4314;&#4317;&#4305;&#4312;&#4321; (&#4315;&#4304;&#4306;&#4304;&#4314;&#4312;&#4311;&#4304;&#4307; &#4330;&#4334;&#4320;&#4312;&#4314;&#4308;&#4305;&#4312;&#4321;&#4304;&#4311;&#4309;&#4312;&#4321;) &#4318;&#4312;&#4320;&#4309;&#4308;&#4314; &#4304;&#4320;&#4308;&#4328;&#4312; &#4304;&#4334;&#4304;&#4314; &#4330;&#4304;&#4314;&#4313;&#4308; &#4329;&#4304;&#4316;&#4304;&#4320;&#4311;&#4310;&#4308;
&#4307;&#4304;&#4311;&#4309;&#4304;&#4314;&#4312;&#4308;&#4320;&#4308;&#4305;&#4304;. &#4330;&#4309;&#4314;&#4304;&#4307;&#4311;&#4304; &#4306;&#4304;&#4320;&#4308;&#4315;&#4317;&#4321; &#4304;&#4320;&#4312;&#4321; &#4306;&#4304;&#4321;&#4304;&#4321;&#4323;&#4324;&#4311;&#4304;&#4309;&#4308;&#4305;&#4314;&#4304;&#4307; (&#4315;&#4304;&#4306;&#4304;&#4314;&#4312;&#4311;&#4304;&#4307; &#4318;&#4320;&#4317;&#4306;&#4320;&#4304;&#4315;&#4312;&#4321; &#4334;&#4308;&#4314;&#4304;&#4334;&#4314;&#4304;
&#4328;&#4308;&#4321;&#4320;&#4323;&#4314;&#4308;&#4305;&#4312;&#4321; &#4307;&#4320;&#4317;&#4321;) &#4321;&#4304;&#4313;&#4315;&#4304;&#4320;&#4312;&#4321;&#4312;&#4304; &#4307;&#4304;&#4309;&#4304;&#4332;&#4313;&#4304;&#4318;&#4323;&#4316;&#4317;&#4311; &#4304;&#4320;&#4308;&#4321; &#4311;&#4304;&#4309;&#4310;&#4308; &#4315;&#4317;&#4311;&#4304;&#4309;&#4321;&#4308;&#4305;&#4323;&#4314; &#4330;&#4317;&#4330;&#4334;&#4312;&#4321; &#4318;&#4312;&#4325;&#4322;&#4317;&#4306;&#4320;&#4304;&#4315;&#4310;&#4308;.
&#4304;&#4315;&#4306;&#4309;&#4304;&#4320;&#4312; &#4315;&#4308;&#4311;&#4317;&#4307;&#4312; &#4328;&#4308;&#4321;&#4304;&#4305;&#4304;&#4315;&#4312;&#4321;&#4312; &#4304;&#4320;&#4312;&#4321; &#4306;&#4304;&#4321;&#4304;&#4321;&#4323;&#4324;&#4311;&#4304;&#4309;&#4308;&#4305;&#4314;&#4304;&#4307;<span style="">&nbsp;
</span>&#4321;&#4334;&#4309;&#4304; &#4329;&#4304;&#4316;&#4304;&#4320;&#4311;&#4308;&#4305;&#4328;&#4312;&#4330; &#4306;&#4304;&#4315;&#4317;&#4312;&#4327;&#4308;&#4316;&#4308;&#4305;&#4304;. <span style="">&nbsp;</span>&#4315;&#4317;&#4313;&#4314;&#4308;&#4307;
&#4304;&#4309;&#4326;&#4332;&#4308;&#4320;&#4311; &#4307;&#4304;&#4316;&#4304;&#4320;&#4329;&#4308;&#4316; &#4317;&#4320; &#4329;&#4304;&#4316;&#4304;&#4320;&#4311;&#4321;&#4304;&#4330;: <b style="">History</b>
&#4329;&#4304;&#4316;&#4304;&#4320;&#4311;&#4312; &#4328;&#4308;&#4312;&#4330;&#4304;&#4309;&#4321; &#4304;&#4307;&#4320;&#4308; &#4315;&#4312;&#4330;&#4308;&#4315;&#4323;&#4314;&#4312; &#4305;&#4320;&#4331;&#4304;&#4316;&#4308;&#4305;&#4308;&#4305;&#4312;&#4321; &#4316;&#4323;&#4321;&#4334;&#4304;&#4321;, &#4334;&#4317;&#4314;&#4317;<span style="">&nbsp;&nbsp; </span><b style="">Connections</b>
&#4329;&#4304;&#4316;&#4304;&#4320;&#4311;&#4312; &#4321;&#4304;&#4328;&#4323;&#4304;&#4314;&#4308;&#4305;&#4304;&#4321; &#4306;&#4309;&#4304;&#4331;&#4314;&#4308;&#4309;&#4321; &#4312;&#4317;&#4314;&#4304;&#4307; &#4315;&#4312;&#4309;&#4323;&#4308;&#4320;&#4311;&#4307;&#4308;&#4311; &#4321;&#4334;&#4309;&#4304;&#4307;&#4321;&#4334;&#4309;&#4304; &#4315;&#4317;&#4316;&#4304;&#4330;&#4308;&#4315;&#4311;&#4304; &#4332;&#4327;&#4304;&#4320;&#4317;&#4308;&#4305;&#4321; &#4307;&#4304; &#4306;&#4304;&#4315;&#4317;&#4309;&#4312;&#4313;&#4309;&#4314;&#4312;&#4317;&#4311;
&#4312;&#4325; &#4304;&#4320;&#4321;&#4308;&#4305;&#4323;&#4314;&#4312; &#4315;&#4317;&#4316;&#4304;&#4330;&#4308;&#4315;&#4308;&#4305;&#4312;. &#4327;&#4309;&#4308;&#4314;&#4304;&#4310;&#4308; &#4315;&#4308;&#4322; &#4329;&#4304;&#4316;&#4304;&#4320;&#4311;&#4321; &#4315;&#4308;&#4317;&#4311;&#4334;&#4308; &#4304;&#4320;&#4308; &#4328;&#4308;&#4312;&#4330;&#4304;&#4309;&#4321;. &#4318;&#4312;&#4320;&#4309;&#4308;&#4314;&#4312; &#4329;&#4304;&#4316;&#4304;&#4320;&#4311;&#4312;
- <span style="">&nbsp;</span><b style="">Files</b>
&#4304;&#4321;&#4304;&#4334;&#4304;&#4309;&#4304;&#4321; &#4313;&#4317;&#4315;&#4318;&#4312;&#4323;&#4322;&#4308;&#4320;&#4328;&#4312; &#4304;&#4320;&#4321;&#4308;&#4305;&#4323;&#4314;&#4312; &#4324;&#4317;&#4314;&#4307;&#4308;&#4320;&#4308;&#4305;&#4312;&#4321; &#4321;&#4322;&#4320;&#4323;&#4325;&#4322;&#4323;&#4320;&#4304;&#4321; &#4311;&#4304;&#4309;&#4312;&#4321;&#4312; &#4324;&#4304;&#4312;&#4314;&#4308;&#4305;&#4312;&#4311;. &#4304;&#4325;&#4309;&#4308; &#4328;&#4308;&#4306;&#4309;&#4312;&#4331;&#4314;&#4312;&#4304;
&#4309;&#4304;&#4332;&#4304;&#4320;&#4315;&#4317;&#4317;&#4311; &#4317;&#4318;&#4308;&#4320;&#4304;&#4330;&#4312;&#4308;&#4305;&#4312; &#4324;&#4317;&#4314;&#4307;&#4308;&#4320;&#4308;&#4305;&#4321;&#4304; &#4307;&#4304; &#4324;&#4304;&#4312;&#4314;&#4308;&#4305;&#4310;&#4308; (&#4332;&#4304;&#4328;&#4314;&#4304;, &#4313;&#4317;&#4318;&#4312;&#4320;&#4308;&#4305;&#4304;,<span style="">&nbsp; </span>&#4306;&#4304;&#4307;&#4304;&#4322;&#4304;&#4316;&#4304; &#4307;&#4304; &#4321;&#4334;&#4309;&#4304;). <b style="">Plots</b> &#4329;&#4304;&#4316;&#4304;&#4320;&#4311;&#4312; &#4306;&#4309;&#4304;&#4329;&#4309;&#4308;&#4316;&#4308;&#4305;&#4321; &#4318;&#4320;&#4317;&#4306;&#4320;&#4304;&#4315;&#4312;&#4321; &#4328;&#4308;&#4321;&#4320;&#4323;&#4314;&#4308;&#4305;&#4312;&#4321; &#4328;&#4308;&#4307;&#4308;&#4306;&#4304;&#4307; (&#4311;&#4323; &#4312;&#4321; &#4304;&#4321;&#4308;&#4311; &#4305;&#4320;&#4331;&#4304;&#4316;&#4308;&#4305;&#4308;&#4305;&#4321;
&#4328;&#4308;&#4312;&#4330;&#4304;&#4309;&#4307;&#4304;) &#4307;&#4304;&#4315;&#4323;&#4328;&#4304;&#4309;&#4308;&#4305;&#4323;&#4314; &#4307;&#4304; &#4315;&#4317;&#4315;&#4310;&#4304;&#4307;&#4308;&#4305;&#4323;&#4314; &#4306;&#4320;&#4304;&#4324;&#4312;&#4313;&#4323;&#4314; &#4312;&#4316;&#4324;&#4317;&#4320;&#4315;&#4304;&#4330;&#4312;&#4304;&#4321; (&#4306;&#4320;&#4304;&#4324;&#4312;&#4313;&#4308;&#4305;&#4312;, &#4307;&#4312;&#4304;&#4306;&#4320;&#4304;&#4315;&#4308;&#4305;&#4312;
&#4307;&#4304; &#4321;&#4334;&#4309;&#4304;). &#4304;&#4325;&#4309;&#4308;&#4304; &#4328;&#4308;&#4321;&#4304;&#4331;&#4314;&#4308;&#4305;&#4308;&#4314;&#4312; &#4304;&#4315; &#4315;&#4304;&#4321;&#4304;&#4314;&#4312;&#4321; &#4308;&#4325;&#4321;&#4318;&#4317;&#4320;&#4322;&#4312; (&#4328;&#4308;&#4316;&#4304;&#4334;&#4309;&#4304;) &#4321;&#4334;&#4309;&#4304;&#4307;&#4321;&#4304;&#4334;&#4309;&#4304; &#4324;&#4317;&#4320;&#4315;&#4304;&#4322;&#4308;&#4305;&#4328;&#4312;.
&#4329;&#4304;&#4316;&#4304;&#4320;&#4311;&#4312; <b style="">Packages</b> &#4306;&#4309;&#4304;&#4329;&#4309;&#4308;&#4316;&#4308;&#4305;&#4321; &#4321;&#4312;&#4321;&#4322;&#4308;&#4315;&#4304;&#4328;&#4312;
&#4307;&#4304;&#4312;&#4316;&#4321;&#4322;&#4304;&#4314;&#4312;&#4320;&#4308;&#4305;&#4323;&#4314;&#4312; &#4318;&#4304;&#4313;&#4308;&#4322;&#4308;&#4305;&#4312;&#4321; &#4321;&#4312;&#4304;&#4321;, &#4328;&#4308;&#4321;&#4304;&#4331;&#4314;&#4308;&#4305;&#4308;&#4314;&#4312;&#4304; &#4304;&#4334;&#4304;&#4314;&#4312; &#4318;&#4304;&#4313;&#4308;&#4322;&#4312;&#4321; &#4307;&#4304;&#4312;&#4316;&#4321;&#4322;&#4304;&#4314;&#4312;&#4320;&#4308;&#4305;&#4304;, &#4304;&#4320;&#4321;&#4308;&#4305;&#4323;&#4314;&#4312;
&#4318;&#4304;&#4313;&#4308;&#4322;&#4308;&#4305;&#4312;&#4321; &#4315;&#4312;&#4308;&#4320;&#4311;&#4308;&#4305;&#4304; &#4304;&#4316; &#4306;&#4304;&#4316;&#4304;&#4334;&#4314;&#4308;&#4305;&#4304;, &#4315;&#4304;&#4311;&#4310;&#4308; &#4312;&#4316;&#4324;&#4317;&#4320;&#4315;&#4304;&#4330;&#4312;&#4312;&#4321; &#4315;&#4317;&#4318;&#4317;&#4309;&#4308;&#4305;&#4304;. R-&#4312;&#4321; &#4331;&#4312;&#4320;&#4312;&#4311;&#4304;&#4307;&#4312; &#4318;&#4320;&#4317;&#4306;&#4320;&#4304;&#4315;&#4304;
&#4315;&#4317;&#4312;&#4330;&#4304;&#4309;&#4321; &#4323;&#4304;&#4315;&#4320;&#4304;&#4309; &#4324;&#4323;&#4316;&#4325;&#4330;&#4312;&#4304;&#4321;, &#4311;&#4323;&#4315;&#4330;&#4304; &#4327;&#4309;&#4308;&#4314;&#4304; &#4304;&#4320;&#4321;&#4308;&#4305;&#4323;&#4314;&#4312; &#4324;&#4323;&#4316;&#4325;&#4330;&#4312;&#4312;&#4321; &#4332;&#4312;&#4316;&#4304;&#4321;&#4332;&#4304;&#4320; &#4306;&#4304;&#4316;&#4321;&#4304;&#4310;&#4326;&#4309;&#4320;&#4304; &#4307;&#4304; &#4318;&#4320;&#4317;&#4306;&#4320;&#4304;&#4315;&#4304;&#4328;&#4312;
&#4306;&#4304;&#4311;&#4309;&#4304;&#4314;&#4312;&#4321;&#4332;&#4312;&#4316;&#4308;&#4305;&#4304; &#4328;&#4308;&#4323;&#4331;&#4314;&#4308;&#4305;&#4308;&#4314;&#4312;&#4304;. &#4307;&#4320;&#4317; &#4307;&#4304; &#4307;&#4320;&#4317;<span style="">&nbsp; </span>&#4315;&#4323;&#4328;&#4304;&#4309;&#4307;&#4308;&#4305;&#4304;
&#4304;&#4334;&#4304;&#4314;&#4312; &#4321;&#4322;&#4304;&#4322;&#4312;&#4321;&#4322;&#4312;&#4313;&#4323;&#4320;&#4312;, &#4315;&#4317;&#4316;&#4304;&#4330;&#4308;&#4315;&#4311;&#4304; &#4307;&#4304;&#4315;&#4323;&#4328;&#4304;&#4309;&#4308;&#4305;&#4312;&#4321; &#4315;&#4308;&#4311;&#4317;&#4307;&#4308;&#4305;&#4312;, &#4312;&#4325;&#4315;&#4316;&#4308;&#4305;&#4304; &#4304;&#4334;&#4304;&#4314;&#4312; &#4324;&#4323;&#4316;&#4325;&#4330;&#4312;&#4308;&#4305;&#4312;, &#4320;&#4317;&#4315;&#4314;&#4308;&#4305;&#4312;&#4330;
&#4304;&#4315;&#4304;&#4320;&#4322;&#4312;&#4309;&#4308;&#4305;&#4321; &#4304;&#4315;&#4317;&#4330;&#4304;&#4316;&#4312;&#4321; &#4306;&#4304;&#4307;&#4304;&#4332;&#4327;&#4309;&#4308;&#4322;&#4304;&#4321; &#4304;&#4316; &#4321;&#4318;&#4308;&#4330;&#4312;&#4304;&#4314;&#4323;&#4320;&#4304;&#4307;&#4304;&#4304; &#4328;&#4308;&#4325;&#4315;&#4316;&#4312;&#4314;&#4312; &#4320;&#4304;&#4312;&#4315;&#4308; &#4309;&#4312;&#4332;&#4320;&#4317; &#4307;&#4304;&#4320;&#4306;&#4312;&#4321; &#4304;&#4315;&#4317;&#4330;&#4304;&#4316;&#4304;&#4311;&#4304;
&#4328;&#4308;&#4321;&#4304;&#4321;&#4320;&#4323;&#4314;&#4308;&#4305;&#4314;&#4304;&#4307;. &#4304;&#4315; &#4318;&#4320;&#4317;&#4330;&#4308;&#4321;&#4312;&#4321; &#4306;&#4304;&#4321;&#4304;&#4304;&#4307;&#4309;&#4312;&#4314;&#4308;&#4305;&#4314;&#4304;&#4307; &#4304;&#4320;&#4321;&#4308;&#4305;&#4317;&#4305;&#4321; R-&#4328;&#4312; &#4318;&#4304;&#4313;&#4308;&#4322;&#4308;&#4305;&#4312;&#4321; &#4307;&#4304;&#4312;&#4316;&#4321;&#4322;&#4304;&#4314;&#4312;&#4320;&#4308;&#4305;&#4312;&#4321;&#4304;
&#4307;&#4304; &#4315;&#4312;&#4308;&#4320;&#4311;&#4308;&#4305;&#4312;&#4321; &#4315;&#4308;&#4325;&#4304;&#4316;&#4312;&#4310;&#4315;&#4312;. &#4328;&#4308;&#4325;&#4315;&#4316;&#4312;&#4314;&#4312; &#4304;&#4311;&#4304;&#4321;&#4317;&#4305;&#4312;&#4311; &#4318;&#4304;&#4313;&#4308;&#4322;&#4312;&#4307;&#4304;&#4316; &#4329;&#4309;&#4308;&#4316; &#4328;&#4308;&#4306;&#4309;&#4312;&#4331;&#4314;&#4312;&#4304; &#4321;&#4304;&#4333;&#4312;&#4320;&#4317; &#4318;&#4304;&#4313;&#4308;&#4322;&#4312;
&#4311;&#4304;&#4309;&#4312;&#4321;&#4312; &#4324;&#4323;&#4316;&#4325;&#4330;&#4312;&#4308;&#4305;&#4312;&#4311; &#4307;&#4304;&#4309;&#4304;&#4312;&#4316;&#4321;&#4322;&#4304;&#4314;&#4312;&#4320;&#4317;&#4311; &#4315;&#4304;&#4320;&#4322;&#4312;&#4309;&#4304;&#4307; &#4307;&#4304; &#4318;&#4320;&#4317;&#4306;&#4320;&#4304;&#4315;&#4304;&#4328;&#4312; &#4315;&#4312;&#4321;&#4312; &#4315;&#4312;&#4308;&#4320;&#4311;&#4308;&#4305;&#4312;&#4321; &#4328;&#4308;&#4315;&#4307;&#4308;&#4306; &#4306;&#4304;&#4315;&#4317;&#4309;&#4312;&#4327;&#4308;&#4316;&#4317;&#4311;
&#4315;&#4311;&#4308;&#4314;&#4312; &#4315;&#4312;&#4321;&#4312; &#4328;&#4308;&#4321;&#4304;&#4331;&#4314;&#4308;&#4305;&#4314;&#4317;&#4305;&#4308;&#4305;&#4312;, &#4324;&#4323;&#4316;&#4325;&#4330;&#4312;&#4308;&#4305;&#4312; &#4329;&#4309;&#4308;&#4316;&#4312; &#4318;&#4320;&#4317;&#4306;&#4320;&#4304;&#4315;&#4312;&#4321; &#4320;&#4308;&#4304;&#4314;&#4312;&#4310;&#4304;&#4330;&#4312;&#4312;&#4321; &#4318;&#4320;&#4317;&#4330;&#4308;&#4321;&#4328;&#4312;. &#4304;&#4334;&#4304;&#4314;&#4312;
&#4318;&#4304;&#4313;&#4308;&#4322;&#4308;&#4305;&#4312;&#4321; &#4307;&#4304;&#4315;&#4315;&#4323;&#4328;&#4304;&#4309;&#4308;&#4305;&#4308;&#4314;&#4312; &#4318;&#4320;&#4317;&#4306;&#4320;&#4304;&#4315;&#4312;&#4321;&#4322;&#4308;&#4305;&#4312; &#4304;&#4311;&#4304;&#4309;&#4321;&#4308;&#4305;&#4308;&#4316; &#4315;&#4304;&#4311; R-&#4312;&#4321; &#4327;&#4317;&#4309;&#4314;&#4312;&#4321;&#4315;&#4317;&#4315;&#4330;&#4309;&#4308;&#4314; &#4325;&#4321;&#4308;&#4314;&#4323;&#4320; &#4304;&#4320;&#4325;&#4312;&#4309;&#4328;&#4312;
(CRAN), &#4321;&#4304;&#4312;&#4307;&#4304;&#4316;&#4304;&#4330; &#4315;&#4334;&#4317;&#4314;&#4317;&#4307; &#4318;&#4304;&#4313;&#4308;&#4322;&#4312;&#4321; &#4321;&#4304;&#4311;&#4304;&#4323;&#4320;&#4312;&#4321; &#4315;&#4312;&#4311;&#4312;&#4311;&#4308;&#4305;&#4312;&#4311; &#4328;&#4308;&#4306;&#4309;&#4312;&#4331;&#4314;&#4312;&#4304; &#4306;&#4304;&#4315;&#4317;&#4309;&#4312;&#4327;&#4308;&#4316;&#4317;&#4311; &#4315;&#4312;&#4321;&#4312; &#4328;&#4308;&#4321;&#4304;&#4331;&#4314;&#4308;&#4305;&#4314;&#4317;&#4305;&#4308;&#4305;&#4312;.
R-&#4312;&#4321; &#4331;&#4304;&#4314;&#4304; &#4315;&#4312;&#4321; &#4315;&#4317;&#4325;&#4316;&#4312;&#4314;&#4317;&#4305;&#4304;&#4328;&#4312;, <span style="">&nbsp;</span>&#4312;&#4317;&#4314;&#4304;&#4307; &#4306;&#4304;&#4324;&#4304;&#4320;&#4311;&#4317;&#4308;&#4305;&#4304;&#4328;&#4312;&#4304;.
&#4306;&#4304;&#4320;&#4307;&#4304; &#4304;&#4315; &#4329;&#4304;&#4316;&#4304;&#4320;&#4311;&#4312;&#4307;&#4304;&#4316;, &#4304;&#4334;&#4304;&#4314;&#4312; &#4318;&#4304;&#4313;&#4308;&#4322;&#4312;&#4321; &#4307;&#4304;&#4312;&#4316;&#4321;&#4322;&#4304;&#4314;&#4312;&#4320;&#4308;&#4305;&#4304; &#4313;&#4317;&#4316;&#4321;&#4317;&#4314;&#4312;&#4321; &#4304;&#4320;&#4308;&#4328;&#4312; &#4305;&#4320;&#4331;&#4304;&#4316;&#4308;&#4305;&#4312;&#4321; &#4304;&#4313;&#4320;&#4308;&#4305;&#4312;&#4311;&#4304;&#4330;&#4304;&#4304;
&#4328;&#4308;&#4321;&#4304;&#4331;&#4314;&#4308;&#4305;&#4308;&#4314;&#4312;.<span style="">&nbsp; </span>&#4304;&#4315;&#4312;&#4321;&#4304;&#4311;&#4309;&#4312;&#4321; &#4313;&#4317;&#4316;&#4321;&#4317;&#4314;&#4328;&#4312; &#4315;&#4317;&#4332;&#4309;&#4308;&#4309;&#4312;&#4321;
&#4313;&#4323;&#4320;&#4321;&#4317;&#4320;&#4311;&#4304;&#4316; &#4323;&#4316;&#4307;&#4304; &#4304;&#4309;&#4313;&#4320;&#4312;&#4305;&#4317;&#4311; &#4305;&#4320;&#4331;&#4304;&#4316;&#4308;&#4305;&#4304; install.packages() <span style="">&nbsp;</span>&#4307;&#4304; &#4321;&#4304;&#4321;&#4323;&#4320;&#4309;&#4308;&#4314;&#4312; &#4318;&#4304;&#4313;&#4308;&#4322;&#4312;&#4321; &#4321;&#4304;&#4334;&#4308;&#4314;&#4312; &#4307;&#4304; &#4307;&#4304;&#4309;&#4304;&#4332;&#4309;&#4308;&#4311; Enter &#4313;&#4314;&#4304;&#4309;&#4312;&#4328;&#4321;.
&#4318;&#4304;&#4313;&#4308;&#4322;&#4312; &#4304;&#4309;&#4322;&#4317;&#4315;&#4304;&#4322;&#4323;&#4320;&#4304;&#4307; &#4307;&#4304;&#4312;&#4316;&#4321;&#4322;&#4304;&#4314;&#4312;&#4320;&#4307;&#4308;&#4305;&#4304;. &#4315;&#4304;&#4306;&#4304;&#4314;&#4312;&#4311;&#4304;&#4307;:<o:p></o:p></span></p>


<p class="MsoNormal" style="text-align: justify; line-height: 150%; font-family: Courier New,Courier,monospace;"><span style="font-size: 12pt; line-height: 150%;" lang="GEO/KAT">install.packages(&#8221;</span><span style="font-size: 12pt; line-height: 150%;" lang="GEO/KAT">&#4318;&#4304;&#4313;&#4308;&#4322;&#4312;&#4321;</span><span style="font-size: 12pt; line-height: 150%;" lang="GEO/KAT"> </span><span style="font-size: 12pt; line-height: 150%;" lang="GEO/KAT">&#4321;&#4304;&#4334;&#4308;&#4314;&#4312;</span><span style="font-size: 12pt; line-height: 150%;" lang="GEO/KAT">&#8221;)<o:p></o:p></span></p>


<p class="MsoNormal" style="text-align: justify; line-height: 150%; font-family: Courier New,Courier,monospace;"><span style="font-size: 12pt; line-height: 150%;" lang="GEO/KAT">install.packages(&#8220;data.table&#8221;)<span style="">&nbsp;&nbsp;&nbsp; </span><span style="">&nbsp;</span><o:p></o:p></span></p>


<p class="MsoNormal" style="text-align: justify; line-height: 150%;"><span style="font-size: 12pt; line-height: 150%;" lang="GEO/KAT"><span style="font-family: Courier New,Courier,monospace;">install.packages(&#8220;ggplot2&#8221;)</span><o:p></o:p></span></p>


<p class="MsoNormal" style="text-align: justify; line-height: 150%;"><span style="font-size: 12pt; line-height: 150%; font-family: &quot;Sylfaen&quot;,&quot;serif&quot;;" lang="GEO/KAT">&#4318;&#4304;&#4313;&#4308;&#4322;&#4312;&#4321;
&#4307;&#4304;&#4312;&#4316;&#4321;&#4322;&#4304;&#4314;&#4312;&#4320;&#4308;&#4305;&#4304; &#4321;&#4312;&#4321;&#4322;&#4308;&#4315;&#4304;&#4328;&#4312; &#4334;&#4307;&#4308;&#4305;&#4304; &#4308;&#4320;&#4311;&#4335;&#4308;&#4320;. &#4315;&#4312;&#4321;&#4312; &#4306;&#4304;&#4315;&#4317;&#4327;&#4308;&#4316;&#4308;&#4305;&#4312;&#4321; &#4332;&#4312;&#4316; &#4304;&#4323;&#4330;&#4312;&#4314;&#4308;&#4305;&#4308;&#4314;&#4312;&#4304;<span style="">&nbsp; </span>&#4329;&#4309;&#4308;&#4316;&#4312;<span style="">&nbsp; </span>&#4318;&#4320;&#4317;&#4306;&#4320;&#4304;&#4315;&#4312;&#4321;
&#4322;&#4308;&#4325;&#4321;&#4322;&#4328;&#4312; &#4315;&#4317;&#4309;&#4304;&#4334;&#4307;&#4312;&#4316;&#4317;&#4311; &#4318;&#4304;&#4313;&#4308;&#4322;&#4312;&#4321; &#4315;&#4312;&#4308;&#4320;&#4311;&#4308;&#4305;&#4304; library() &#4305;&#4320;&#4331;&#4304;&#4316;&#4308;&#4305;&#4312;&#4321;<span style="">&nbsp; </span>&#4315;&#4308;&#4328;&#4309;&#4308;&#4317;&#4305;&#4312;&#4311;. &#4315;&#4304;&#4306;&#4304;&#4314;&#4312;&#4311;&#4304;&#4307;:<o:p></o:p></span></p>


<p class="MsoNormal" style="text-align: justify; line-height: 150%; font-family: Courier New,Courier,monospace;"><span style="font-size: 12pt; line-height: 150%;" lang="GEO/KAT">library(</span><span style="font-size: 12pt; line-height: 150%;" lang="GEO/KAT">&#4318;&#4304;&#4313;&#4308;&#4322;&#4312;&#4321;</span><span style="font-size: 12pt; line-height: 150%;" lang="GEO/KAT"> </span><span style="font-size: 12pt; line-height: 150%;" lang="GEO/KAT">&#4321;&#4304;&#4334;&#4308;&#4314;&#4312;</span><span style="font-size: 12pt; line-height: 150%;" lang="GEO/KAT">)</span><span style="font-size: 12pt; line-height: 150%;" lang="GEO/KAT"><o:p></o:p></span></p>


<p class="MsoNormal" style="text-align: justify; line-height: 150%; font-family: Courier New,Courier,monospace;"><span style="font-size: 12pt; line-height: 150%;" lang="GEO/KAT">library(ggplot2)<o:p></o:p></span></p>


<p class="MsoNormal" style="text-align: justify; line-height: 150%;"><span style="font-size: 12pt; line-height: 150%;" lang="GEO/KAT"><span style="font-family: Courier New,Courier,monospace;">library(dplyr)</span><o:p></o:p></span></p>


<p class="MsoNormal" style="text-align: justify; line-height: 150%;"><span style="font-size: 12pt; line-height: 150%; font-family: &quot;Sylfaen&quot;,&quot;serif&quot;;" lang="GEO/KAT">&#4308;&#4321;
&#4305;&#4320;&#4331;&#4304;&#4316;&#4308;&#4305;&#4304; &#4304;&#4312;&#4313;&#4320;&#4312;&#4305;&#4308;&#4305;&#4304; &#4318;&#4320;&#4317;&#4306;&#4320;&#4304;&#4315;&#4312;&#4321; &#4322;&#4308;&#4325;&#4321;&#4322;&#4312;&#4321; &#4304;&#4320;&#4308;&#4328;&#4312; &#4307;&#4304; &#4328;&#4308;&#4321;&#4320;&#4323;&#4314;&#4307;&#4308;&#4305;&#4304; &#4329;&#4309;&#4308;&#4316;&#4321; &#4318;&#4320;&#4317;&#4306;&#4320;&#4304;&#4315;&#4304;&#4321;&#4311;&#4304;&#4316; &#4308;&#4320;&#4311;&#4317;&#4305;&#4314;&#4312;&#4309;&#4304;&#4307;.
&#4318;&#4304;&#4313;&#4308;&#4322;&#4312;&#4321; &#4315;&#4312;&#4308;&#4320;&#4311;&#4308;&#4305;&#4304; &#4318;&#4320;&#4317;&#4306;&#4320;&#4304;&#4315;&#4304;&#4321;&#4311;&#4304;&#4316; &#4321;&#4304;&#4333;&#4312;&#4320;&#4317;&#4304; R-&#4311;&#4304;&#4316; &#4315;&#4323;&#4328;&#4304;&#4317;&#4305;&#4312;&#4321; &#4327;&#4317;&#4309;&#4308;&#4314;&#4312; &#4304;&#4334;&#4304;&#4314;&#4312; &#4321;&#4308;&#4321;&#4312;&#4312;&#4321; &#4307;&#4304;&#4332;&#4327;&#4308;&#4305;&#4312;&#4321;
&#4307;&#4320;&#4317;&#4321;, &#4315;&#4304;&#4328;&#4312;&#4316; &#4320;&#4317;&#4330;&#4304; &#4308;&#4320;&#4311;&#4335;&#4308;&#4320; &#4307;&#4304;&#4312;&#4316;&#4321;&#4322;&#4304;&#4314;&#4312;&#4320;&#4308;&#4305;&#4323;&#4314;&#4312; &#4318;&#4304;&#4313;&#4308;&#4322;&#4312; &#4323;&#4313;&#4309;&#4308; &#4321;&#4312;&#4321;&#4322;&#4308;&#4315;&#4304;&#4328;&#4312; &#4312;&#4325;&#4316;&#4308;&#4305;&#4304;. &#4315;&#4312;&#4308;&#4320;&#4311;&#4308;&#4305;&#4312;&#4321;
&#4328;&#4308;&#4315;&#4307;&#4308;&#4306; &#4318;&#4320;&#4317;&#4306;&#4320;&#4304;&#4315;&#4312;&#4321; &#4322;&#4308;&#4325;&#4321;&#4322;&#4328;&#4312; &#4328;&#4308;&#4306;&#4309;&#4312;&#4331;&#4314;&#4312;&#4304; &#4311;&#4304;&#4309;&#4312;&#4321;&#4323;&#4324;&#4314;&#4304;&#4307; &#4306;&#4304;&#4315;&#4317;&#4309;&#4312;&#4327;&#4308;&#4316;&#4317;&#4311; &#4318;&#4304;&#4313;&#4308;&#4322;&#4312;&#4321; &#4327;&#4309;&#4308;&#4314;&#4304; &#4324;&#4323;&#4316;&#4325;&#4330;&#4312;&#4304;.
&#4323;&#4330;&#4316;&#4317;&#4305;&#4312; &#4318;&#4304;&#4313;&#4308;&#4322;&#4312;&#4321; &#4307;&#4304;&#4316;&#4312;&#4328;&#4316;&#4323;&#4314;&#4308;&#4305;&#4312;&#4321;&#4304; &#4307;&#4304; &#4315;&#4304;&#4321;&#4328;&#4312; &#4328;&#4308;&#4315;&#4304;&#4309;&#4304;&#4314;&#4312; &#4324;&#4323;&#4316;&#4325;&#4330;&#4312;&#4308;&#4305;&#4312;&#4321; &#4328;&#4308;&#4321;&#4304;&#4334;&#4308;&#4305; &#4312;&#4316;&#4324;&#4317;&#4320;&#4315;&#4304;&#4330;&#4312;&#4304; &#4328;&#4308;&#4306;&#4309;&#4312;&#4331;&#4314;&#4312;&#4304;
&#4315;&#4317;&#4309;&#4312;&#4318;&#4317;&#4309;&#4317;&#4311; &#4328;&#4308;&#4315;&#4307;&#4308;&#4306;&#4312; &#4305;&#4320;&#4331;&#4304;&#4316;&#4308;&#4305;&#4312;&#4311;:<o:p></o:p></span></p>


<p class="MsoNormal" style="text-align: justify; line-height: 150%; font-family: Courier New,Courier,monospace;"><span style="font-size: 12pt; line-height: 150%;" lang="GEO/KAT">help(package=&#8221;</span><span style="font-size: 12pt; line-height: 150%;" lang="GEO/KAT">&#4318;&#4304;&#4313;&#4308;&#4322;&#4312;&#4321;</span><span style="font-size: 12pt; line-height: 150%;" lang="GEO/KAT"> </span><span style="font-size: 12pt; line-height: 150%;" lang="GEO/KAT">&#4321;&#4304;&#4334;&#4308;&#4314;&#4312;</span><span style="font-size: 12pt; line-height: 150%;" lang="GEO/KAT">&#8221;)</span><span style="font-size: 12pt; line-height: 150%;" lang="GEO/KAT"><o:p></o:p></span></p>


<p class="MsoNormal" style="text-align: justify; line-height: 150%;"><span style="font-size: 12pt; line-height: 150%;" lang="GEO/KAT"><span style="font-family: Courier New,Courier,monospace;">help(package=&#8221; dplyr &#8221;)</span><o:p></o:p></span></p>


<p class="MsoNormal" style="text-align: justify; line-height: 150%;"><span style="font-size: 12pt; line-height: 150%; font-family: &quot;Sylfaen&quot;,&quot;serif&quot;;" lang="GEO/KAT">&#4308;&#4321;
&#4307;&#4304; &#4321;&#4334;&#4309;&#4304; &#4304;&#4315;&#4306;&#4309;&#4304;&#4320;&#4312; &#4307;&#4304;&#4334;&#4315;&#4304;&#4320;&#4308;&#4305;&#4312;&#4321; &#4312;&#4316;&#4324;&#4317;&#4320;&#4315;&#4304;&#4330;&#4312;&#4304; &#4306;&#4304;&#4315;&#4317;&#4312;&#4322;&#4304;&#4316;&#4308;&#4305;&#4304; &#4315;&#4308;&#4317;&#4311;&#4334;&#4308; &#4304;&#4320;&#4308;&#4328;&#4312; <b style="">Help</b> &#4329;&#4304;&#4316;&#4304;&#4320;&#4311;&#4310;&#4308;. <span style="">&nbsp;</span>R-&#4321; &#4331;&#4304;&#4314;&#4310;&#4308; &#4309;&#4320;&#4330;&#4308;&#4314;&#4312; &#4307;&#4304;&#4334;&#4315;&#4304;&#4320;&#4308;&#4305;&#4312;&#4321; &#4321;&#4312;&#4321;&#4322;&#4308;&#4315;&#4304; &#4306;&#4304;&#4304;&#4329;&#4316;&#4312;&#4304;, &#4315;&#4312;&#4321;&#4312;
&#4327;&#4309;&#4308;&#4314;&#4304; &#4318;&#4304;&#4313;&#4308;&#4322;&#4312;, &#4324;&#4323;&#4316;&#4325;&#4330;&#4312;&#4304; &#4307;&#4317;&#4313;&#4323;&#4315;&#4308;&#4316;&#4322;&#4312;&#4320;&#4308;&#4305;&#4323;&#4314;&#4312;&#4304;, &#4315;&#4317;&#4327;&#4309;&#4304;&#4316;&#4312;&#4314;&#4312;&#4304; &#4306;&#4304;&#4316;&#4315;&#4304;&#4320;&#4322;&#4308;&#4305;&#4308;&#4305;&#4312;, &#4306;&#4304;&#4315;&#4317;&#4327;&#4308;&#4316;&#4308;&#4305;&#4312;&#4321; &#4315;&#4304;&#4306;&#4304;&#4314;&#4312;&#4311;&#4308;&#4305;&#4312;.
<span style="">&nbsp;</span>&#4307;&#4304; &#4305;&#4317;&#4314;&#4317; <b style="">Viewer</b> &#4329;&#4304;&#4316;&#4304;&#4320;&#4311;&#4312; &#4306;&#4304;&#4315;&#4317;&#4312;&#4327;&#4308;&#4316;&#4308;&#4305;&#4304; &#4314;&#4317;&#4313;&#4304;&#4314;&#4323;&#4320;&#4312; &#4309;&#4308;&#4305;-&#4313;&#4317;&#4316;&#4322;&#4308;&#4316;&#4322;&#4312;&#4321; &#4307;&#4304;&#4321;&#4304;&#4311;&#4309;&#4304;&#4314;&#4312;&#4308;&#4320;&#4308;&#4305;&#4314;&#4304;&#4307;,
&#4320;&#4317;&#4315;&#4308;&#4314;&#4312;&#4330; &#4328;&#4308;&#4321;&#4304;&#4331;&#4314;&#4308;&#4305;&#4308;&#4314;&#4312;&#4304; &#4306;&#4308;&#4316;&#4308;&#4320;&#4312;&#4320;&#4308;&#4305;&#4323;&#4314; &#4312;&#4325;&#4316;&#4304;&#4321; &#4321;&#4334;&#4309;&#4304;&#4307;&#4304;&#4321;&#4334;&#4309;&#4304; &#4318;&#4304;&#4313;&#4308;&#4322;&#4308;&#4305;&#4312;&#4321;<span style="">&nbsp; </span>&#4315;&#4308;&#4328;&#4309;&#4308;&#4317;&#4305;&#4312;&#4311;.<o:p></o:p></span></p>


<p class="MsoNormal" style="text-align: justify; line-height: 150%;"><span style="font-size: 12pt; line-height: 150%; font-family: &quot;Sylfaen&quot;,&quot;serif&quot;;" lang="GEO/KAT"><span style="">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </span>&#4305;&#4317;&#4314;&#4317;&#4321;, &#4308;&#4320;&#4311;&#4312; &#4315;&#4308;&#4322;&#4304;&#4307; &#4321;&#4304;&#4327;&#4323;&#4320;&#4304;&#4307;&#4326;&#4308;&#4305;&#4317; &#4315;&#4317;&#4315;&#4308;&#4316;&#4322;&#4312;.
&#4304;&#4323;&#4330;&#4312;&#4314;&#4308;&#4305;&#4314;&#4304;&#4307; &#4306;&#4304;&#4304;&#4315;&#4304;&#4334;&#4309;&#4312;&#4314;&#4308;&#4311; &#4327;&#4323;&#4320;&#4304;&#4307;&#4326;&#4308;&#4305;&#4304; &#4305;&#4320;&#4331;&#4304;&#4316;&#4308;&#4305;&#4308;&#4305;&#4312;&#4321;, &#4318;&#4320;&#4317;&#4306;&#4320;&#4304;&#4315;&#4312;&#4321; &#4322;&#4308;&#4325;&#4321;&#4322;&#4312;&#4321; &#4304;&#4316; &#4330;&#4309;&#4314;&#4304;&#4307;&#4308;&#4305;&#4312;&#4321; &#4307;&#4304;&#4321;&#4304;&#4334;&#4308;&#4314;&#4308;&#4305;&#4308;&#4305;&#4312;&#4321;
&#4304;&#4313;&#4320;&#4308;&#4305;&#4312;&#4321;&#4304;&#4321; &#4311;&#4323; &#4320;&#4304; &#4320;&#4308;&#4306;&#4312;&#4321;&#4322;&#4320;&#4328;&#4312;&#4304; &#4312;&#4321;&#4312;&#4316;&#4312;. R &#4315;&#4306;&#4320;&#4331;&#4316;&#4317;&#4305;&#4312;&#4304;&#4320;&#4308;&#4304; &#4320;&#4308;&#4306;&#4312;&#4321;&#4322;&#4320;&#4312;&#4321; &#4315;&#4312;&#4315;&#4304;&#4320;&#4311;! &#4315;&#4304;&#4306;&#4304;&#4314;&#4312;&#4311;&#4304;&#4307; </span><span style="font-size: 12pt; line-height: 150%;" lang="GEO/KAT">Library</span><span style="font-size: 12pt; line-height: 150%; font-family: &quot;Sylfaen&quot;,&quot;serif&quot;;" lang="GEO/KAT"><span style="">&nbsp; </span>&#4307;&#4304; <span style="">&nbsp;</span></span><span style="font-size: 12pt; line-height: 150%;" lang="GEO/KAT">library</span><span style="font-size: 12pt; line-height: 150%; font-family: &quot;Sylfaen&quot;,&quot;serif&quot;;" lang="GEO/KAT"> &#4321;&#4320;&#4323;&#4314;&#4312;&#4304;&#4307; &#4321;&#4334;&#4309;&#4304;&#4307;&#4304;&#4321;&#4334;&#4309;&#4304;
&#4305;&#4320;&#4331;&#4304;&#4316;&#4308;&#4305;&#4308;&#4305;&#4312;&#4304; &#4307;&#4304; &#4318;&#4312;&#4320;&#4309;&#4308;&#4314;&#4312; &#4304;&#4320; &#4312;&#4315;&#4323;&#4328;&#4304;&#4309;&#4308;&#4305;&#4321;, &#4315;&#4317;&#4306;&#4309;&#4330;&#4308;&#4315;&#4321; &#4328;&#4308;&#4322;&#4327;&#4317;&#4305;&#4312;&#4316;&#4308;&#4305;&#4304;&#4321; &#4328;&#4308;&#4330;&#4307;&#4317;&#4315;&#4312;&#4321; &#4328;&#4308;&#4321;&#4304;&#4334;&#4308;&#4305;. <span style="">&nbsp;</span>&#4304;&#4316;&#4304;&#4314;&#4317;&#4306;&#4312;&#4323;&#4320;&#4304;&#4307;, &#4321;&#4320;&#4323;&#4314;&#4312;&#4304;&#4307; &#4321;&#4334;&#4309;&#4304;&#4307;&#4304;&#4321;&#4334;&#4309;&#4304; &#4330;&#4309;&#4314;&#4304;&#4307;&#4308;&#4305;&#4312;&#4304; A &#4307;&#4304;
a.<o:p></o:p></span></p>


<p class="MsoNormal" style="text-align: justify; line-height: 150%;"><span style="font-size: 12pt; line-height: 150%; font-family: &quot;Sylfaen&quot;,&quot;serif&quot;;" lang="GEO/KAT"><span style="">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </span>&#4328;&#4308;&#4309;&#4304;&#4335;&#4304;&#4315;&#4317;&#4311; &#4315;&#4312;&#4326;&#4308;&#4305;&#4323;&#4314;&#4312; &#4330;&#4317;&#4307;&#4316;&#4304;:<span style="">&nbsp; </span>&#4329;&#4309;&#4308;&#4316; &#4323;&#4313;&#4309;&#4308; &#4309;&#4312;&#4330;&#4312;&#4311; &#4320;&#4317;&#4306;&#4317;&#4320; &#4307;&#4304;&#4309;&#4304;&#4312;&#4316;&#4321;&#4322;&#4304;&#4314;&#4312;&#4320;&#4317;&#4311; R &#4307;&#4304; Rstudio,
&#4306;&#4304;&#4309;&#4323;&#4328;&#4309;&#4304;&#4311; &#4318;&#4320;&#4317;&#4306;&#4320;&#4304;&#4315;&#4304;, &#4321;&#4304;&#4333;&#4312;&#4320;&#4317;&#4308;&#4305;&#4312;&#4321;&#4304;&#4315;&#4308;&#4305;&#4320; &#4307;&#4304;&#4309;&#4304;&#4312;&#4316;&#4321;&#4322;&#4304;&#4314;&#4312;&#4320;&#4317;&#4311; &#4318;&#4304;&#4313;&#4308;&#4322;&#4308;&#4305;&#4312;, &#4315;&#4312;&#4309;&#4304;&#4308;&#4320;&#4311;&#4317;&#4307; &#4312;&#4321;&#4312;&#4316;&#4312; &#4318;&#4320;&#4317;&#4306;&#4320;&#4304;&#4315;&#4304;&#4328;&#4312;
&#4306;&#4304;&#4315;&#4317;&#4327;&#4308;&#4316;&#4308;&#4305;&#4312;&#4321; &#4332;&#4312;&#4316;, &#4315;&#4317;&#4309;&#4312;&#4331;&#4312;&#4317;&#4311; &#4307;&#4304;&#4334;&#4315;&#4304;&#4320;&#4308;&#4305;&#4312;&#4321; &#4312;&#4316;&#4324;&#4317;&#4320;&#4315;&#4304;&#4330;&#4312;&#4304; &#4318;&#4304;&#4313;&#4308;&#4322;&#4308;&#4305;&#4312;&#4321;&#4304; &#4307;&#4304; &#4315;&#4304;&#4311;&#4312; &#4324;&#4323;&#4316;&#4325;&#4330;&#4312;&#4308;&#4305;&#4312;&#4321; &#4328;&#4308;&#4321;&#4304;&#4334;&#4308;&#4305;.
&#4304;&#4321;&#4308;&#4309;&#4308;, &#4309;&#4308;&#4320;&#4313;&#4309;&#4308;&#4309;&#4312;&#4311; Rstudio-&#4321; &#4321;&#4304;&#4315;&#4323;&#4328;&#4304;&#4317; &#4304;&#4320;&#4308;&#4308;&#4305;&#4328;&#4312;, &#4315;&#4304;&#4311; &#4307;&#4304;&#4316;&#4312;&#4328;&#4316;&#4323;&#4314;&#4308;&#4305;&#4304;&#4328;&#4312;. &#4305;&#4317;&#4314;&#4317;&#4321;,<span style="">&nbsp; </span>&#4315;&#4320;&#4304;&#4309;&#4304;&#4314; &#4318;&#4320;&#4317;&#4305;&#4314;&#4308;&#4315;&#4304;&#4321; &#4304;&#4312;&#4330;&#4312;&#4314;&#4308;&#4305;&#4311; &#4321;&#4304;&#4315;&#4317;&#4315;&#4304;&#4309;&#4314;&#4317;&#4307; &#4311;&#4323; &#4313;&#4304;&#4320;&#4306;&#4304;&#4307;
&#4307;&#4304;&#4312;&#4334;&#4321;&#4317;&#4315;&#4308;&#4305;&#4311;, &#4320;&#4317;&#4315; <b style="">R &#4315;&#4306;&#4320;&#4331;&#4316;&#4317;&#4305;&#4312;&#4304;&#4320;&#4308;&#4304; &#4320;&#4308;&#4306;&#4312;&#4321;&#4322;&#4320;&#4312;&#4321;
&#4315;&#4312;&#4315;&#4304;&#4320;&#4311;!</b></span></p>
<p class="MsoNormal" style="text-align: justify; line-height: 150%;"><br>
<span style="font-size: 12pt; line-height: 150%; font-family: &quot;Sylfaen&quot;,&quot;serif&quot;;" lang="GEO/KAT"><b style=""><o:p></o:p></b></span></p>



</div>
<div id="footer">
<p style="text-align: right;"><strong>R.Data Blog. Copyright (c) Gocha
Ugulava</strong></p>
</div>
</div>

</body></html>